{"#": 0, "(": 1, ")": 2, "-": 3, "/": 4, "1": 5, "2": 6, "3": 7, "4": 8, "5": 9, "6": 10, "=": 11, "[Br;!R;C]": 12, "[C;!R;BrCC]": 13, "[C;!R;CCCC]": 14, "[C;!R;CCCN]": 15, "[C;!R;CCCO]": 16, "[C;!R;CCCS]": 17, "[C;!R;CCC]": 18, "[C;!R;CCCl]": 19, "[C;!R;CCN]": 20, "[C;!R;CCO]": 21, "[C;!R;CCS]": 22, "[C;!R;CC]": 23, "[C;!R;CFFF]": 24, "[C;!R;CFO]": 25, "[C;!R;CNN]": 26, "[C;!R;CNO]": 27, "[C;!R;CN]": 28, "[C;!R;COO]": 29, "[C;!R;CSS]": 30, "[C;!R;FFFO]": 31, "[C;!R;FFFS]": 32, "[C;!R;NNN]": 33, "[C;!R;NNO]": 34, "[C;!R;NN]": 35, "[C;!R;NOO]": 36, "[C;R;BrCC]": 37, "[C;R;CCCC]": 38, "[C;R;CCCF]": 39, "[C;R;CCCN]": 40, "[C;R;CCCO]": 41, "[C;R;CCCS]": 42, "[C;R;CCC]": 43, "[C;R;CCCl]": 44, "[C;R;CCFF]": 45, "[C;R;CCF]": 46, "[C;R;CCNN]": 47, "[C;R;CCNO]": 48, "[C;R;CCN]": 49, "[C;R;CCOO]": 50, "[C;R;CCOS]": 51, "[C;R;CCO]": 52, "[C;R;CCS]": 53, "[C;R;CNNO]": 54, "[C;R;CNN]": 55, "[C;R;CNO]": 56, "[C;R;CNS]": 57, "[C;R;COO]": 58, "[C;R;COS]": 59, "[C;R;NNN]": 60, "[C;R;NNO]": 61, "[C;R;NNS]": 62, "[C;R;NOO]": 63, "[C;R;NOS]": 64, "[C;R;NSS]": 65, "[CH2;!R;CC]": 66, "[CH2;!R;CF]": 67, "[CH2;!R;CN]": 68, "[CH2;!R;CO]": 69, "[CH2;!R;CS]": 70, "[CH2;!R;C]": 71, "[CH2;!R;OS]": 72, "[CH2;R;CC]": 73, "[CH2;R;CN]": 74, "[CH2;R;CO]": 75, "[CH2;R;CS]": 76, "[CH2;R;NN]": 77, "[CH2;R;NO]": 78, "[CH2;R;NS]": 79, "[CH2;R;OO]": 80, "[CH3;!R;C]": 81, "[CH3;!R;N]": 82, "[CH3;!R;O]": 83, "[CH3;!R;S]": 84, "[CH;!R;CCC]": 85, "[CH;!R;CCF]": 86, "[CH;!R;CCN]": 87, "[CH;!R;CCO]": 88, "[CH;!R;CCS]": 89, "[CH;!R;CC]": 90, "[CH;!R;CFF]": 91, "[CH;!R;CN]": 92, "[CH;!R;COO]": 93, "[CH;!R;CO]": 94, "[CH;!R;CS]": 95, "[CH;!R;FFN]": 96, "[CH;!R;FFO]": 97, "[CH;!R;NN]": 98, "[CH;R;CCC]": 99, "[CH;R;CCN]": 100, "[CH;R;CCO]": 101, "[CH;R;CCS]": 102, "[CH;R;CC]": 103, "[CH;R;CNN]": 104, "[CH;R;CNO]": 105, "[CH;R;CNS]": 106, "[CH;R;CN]": 107, "[CH;R;COO]": 108, "[CH;R;CO]": 109, "[CH;R;NN]": 110, "[Cl;!R;C]": 111, "[F;!R;C]": 112, "[I;!R;C]": 113, "[N;!R;CCC]": 114, "[N;!R;CCN]": 115, "[N;!R;CCO]": 116, "[N;!R;CCS]": 117, "[N;!R;CC]": 118, "[N;!R;CNS]": 119, "[N;!R;CN]": 120, "[N;!R;CO]": 121, "[N;!R;CS]": 122, "[N;!R;C]": 123, "[N;R;CCC]": 124, "[N;R;CCN]": 125, "[N;R;CCO]": 126, "[N;R;CCS]": 127, "[N;R;CC]": 128, "[N;R;CNO]": 129, "[N;R;CNS]": 130, "[N;R;CN]": 131, "[N;R;COS]": 132, "[N;R;CO]": 133, "[N;R;CS]": 134, "[NH2;!R;C]": 135, "[NH2;!R;S]": 136, "[NH;!R;CC]": 137, "[NH;!R;CN]": 138, "[NH;!R;CO]": 139, "[NH;!R;CS]": 140, "[NH;!R;C]": 141, "[NH;!R;NS]": 142, "[NH;R;CC]": 143, "[NH;R;CN]": 144, "[O;!R;CC]": 145, "[O;!R;CN]": 146, "[O;!R;CS]": 147, "[O;!R;C]": 148, "[O;!R;N]": 149, "[O;!R;S]": 150, "[O;R;CC]": 151, "[O;R;CN]": 152, "[OH;!R;C]": 153, "[OH;!R;N]": 154, "[S;!R;CCOO]": 155, "[S;!R;CCO]": 156, "[S;!R;CC]": 157, "[S;!R;CNOO]": 158, "[S;!R;CNO]": 159, "[S;!R;COOO]": 160, "[S;!R;C]": 161, "[S;!R;NNOO]": 162, "[S;R;CCOO]": 163, "[S;R;CCO]": 164, "[S;R;CC]": 165, "[S;R;CNOO]": 166, "[[C@@H];!R;CCC]": 167, "[[C@@H];!R;CCN]": 168, "[[C@@H];!R;CCO]": 169, "[[C@@H];R;CCC]": 170, "[[C@@H];R;CCF]": 171, "[[C@@H];R;CCN]": 172, "[[C@@H];R;CCO]": 173, "[[C@@H];R;CCS]": 174, "[[C@@H];R;COO]": 175, "[[C@@];R;CCCC]": 176, "[[C@@];R;CCCN]": 177, "[[C@@];R;CCCO]": 178, "[[C@H];!R;CCC]": 179, "[[C@H];!R;CCN]": 180, "[[C@H];!R;CCO]": 181, "[[C@H];R;CCC]": 182, "[[C@H];R;CCF]": 183, "[[C@H];R;CCN]": 184, "[[C@H];R;CCO]": 185, "[[C@H];R;CCS]": 186, "[[C@H];R;COO]": 187, "[[C@];!R;CCCO]": 188, "[[C@];R;CCCC]": 189, "[[C@];R;CCCN]": 190, "[[C@];R;CCCO]": 191, "[[N+];!R;COO]": 192, "[[O-];!R;C]": 193, "[[O-];!R;N]": 194, "[[O-];!R;S]": 195, "[[[N@]+];R;CCCC]": 196, "[[n+];R;CCC]": 197, "[[n+];R;CCO]": 198, "[c;R;BrCC]": 199, "[c;R;BrCN]": 200, "[c;R;BrCO]": 201, "[c;R;BrCS]": 202, "[c;R;BrNN]": 203, "[c;R;BrNS]": 204, "[c;R;CCC]": 205, "[c;R;CCCl]": 206, "[c;R;CCF]": 207, "[c;R;CCI]": 208, "[c;R;CCN]": 209, "[c;R;CCO]": 210, "[c;R;CCS]": 211, "[c;R;CCSe]": 212, "[c;R;CClN]": 213, "[c;R;CClS]": 214, "[c;R;CFN]": 215, "[c;R;CNN]": 216, "[c;R;CNO]": 217, "[c;R;CNS]": 218, "[c;R;COO]": 219, "[c;R;COS]": 220, "[c;R;CSS]": 221, "[c;R;ClNN]": 222, "[c;R;ClNS]": 223, "[c;R;NNN]": 224, "[c;R;NNO]": 225, "[c;R;NNS]": 226, "[c;R;NOO]": 227, "[c;R;NOS]": 228, "[c;R;NSS]": 229, "[cH;R;CC]": 230, "[cH;R;CN]": 231, "[cH;R;CO]": 232, "[cH;R;CS]": 233, "[cH;R;NN]": 234, "[cH;R;NO]": 235, "[cH;R;NS]": 236, "[n;R;CCC]": 237, "[n;R;CCN]": 238, "[n;R;CCO]": 239, "[n;R;CCS]": 240, "[n;R;CCSe]": 241, "[n;R;CC]": 242, "[n;R;CNN]": 243, "[n;R;CNS]": 244, "[n;R;CN]": 245, "[n;R;CO]": 246, "[n;R;CS]": 247, "[n;R;CSe]": 248, "[n;R;NN]": 249, "[n;R;NO]": 250, "[n;R;NS]": 251, "[nH;R;CC]": 252, "[nH;R;CN]": 253, "[nH;R;CO]": 254, "[nH;R;NN]": 255, "[o;R;CC]": 256, "[o;R;CN]": 257, "[o;R;NN]": 258, "[s;R;CC]": 259, "[s;R;CN]": 260, "[se;R;CN]": 261, "[se;R;NN]": 262, "\\": 263}