{"#Cc1": 0, "#Cc2": 1, "#N)(": 2, "#N)=": 3, "#N)C": 4, "#N)[nH]": 5, "#N)c": 6, "#N)n": 7, "(-c1": 8, "(-c2": 9, "(-c3": 10, "(-c4": 11, "(-c5": 12, "(-c6": 13, "(-n2": 14, "(-n3": 15, "(-n4": 16, "(/C#": 17, "(/C(": 18, "(/C)": 19, "(/C=": 20, "(/Cc": 21, "(/F)": 22, "(/N=": 23, "(/c1": 24, "(=C(": 25, "(=C)": 26, "(=C/": 27, "(=C1": 28, "(=C2": 29, "(=C3": 30, "(=CC": 31, "(=C\\": 32, "(=Cc": 33, "(=N)": 34, "(=N/": 35, "(=N1": 36, "(=NC": 37, "(=N\\": 38, "(=Nc": 39, "(=O)": 40, "(=S)": 41, "(=c2": 42, "(Br)=": 43, "(Br)[nH]": 44, "(Br)c": 45, "(Br)n": 46, "(Br)o": 47, "(Br)s": 48, "(C#C": 49, "(C#N": 50, "(C(=": 51, "(C(C": 52, "(C(F": 53, "(C(N": 54, "(C(O": 55, "(C(c": 56, "(C)(": 57, "(C)/": 58, "(C)=": 59, "(C)C": 60, "(C)N": 61, "(C)O": 62, "(C)S": 63, "(C)[C@@H]": 64, "(C)[C@H]": 65, "(C)[C@]": 66, "(C)[nH]": 67, "(C)c": 68, "(C)n": 69, "(C)o": 70, "(C)s": 71, "(C/C": 72, "(C/N": 73, "(C1)": 74, "(C1=": 75, "(C1C": 76, "(C1c": 77, "(C2(": 78, "(C2)": 79, "(C23": 80, "(C2=": 81, "(C2C": 82, "(C2N": 83, "(C2O": 84, "(C2c": 85, "(C3(": 86, "(C3)": 87, "(C3=": 88, "(C3C": 89, "(C3N": 90, "(C3c": 91, "(C4)": 92, "(C4=": 93, "(C4C": 94, "(C5)": 95, "(C5C": 96, "(C6C": 97, "(C=C": 98, "(C=N": 99, "(CC#": 100, "(CC(": 101, "(CC)": 102, "(CC/": 103, "(CC1": 104, "(CC2": 105, "(CC3": 106, "(CC4": 107, "(CC=": 108, "(CCC": 109, "(CCN": 110, "(CCO": 111, "(CCS": 112, "(CC[C@@]": 113, "(CC[C@H]": 114, "(CCc": 115, "(CCn": 116, "(CF)": 117, "(CN(": 118, "(CN)": 119, "(CN1": 120, "(CN2": 121, "(CN3": 122, "(CNC": 123, "(CNS": 124, "(CNc": 125, "(CNn": 126, "(CO)": 127, "(COC": 128, "(COc": 129, "(CS(": 130, "(CSC": 131, "(CSc": 132, "(C[C@@H]1": 133, "(C[C@H](": 134, "(C[C@H]1": 135, "(C[C@H]4": 136, "(Cc1": 137, "(Cc2": 138, "(Cc3": 139, "(Cc4": 140, "(Cc5": 141, "(Cl)=": 142, "(Cl)C": 143, "(Cl)c": 144, "(Cl)n": 145, "(Cl)s": 146, "(Cn1": 147, "(Cn2": 148, "(Cn3": 149, "(Cn4": 150, "(F)(": 151, "(F)=": 152, "(F)C": 153, "(F)F": 154, "(F)[C@@]": 155, "(F)c": 156, "(F)n": 157, "(I)c": 158, "(N(C": 159, "(N(c": 160, "(N)(": 161, "(N)=": 162, "(N)C": 163, "(N)N": 164, "(N)O": 165, "(N)c": 166, "(N)n": 167, "(N)s": 168, "(N/C": 169, "(N1C": 170, "(N2C": 171, "(N2N": 172, "(N3C": 173, "(N4C": 174, "(N5C": 175, "(NC(": 176, "(NC1": 177, "(NC2": 178, "(NC3": 179, "(NCC": 180, "(NCc": 181, "(NN1": 182, "(NN2": 183, "(NNC": 184, "(NNS": 185, "(NNc": 186, "(NOC": 187, "(NS(": 188, "(N[C@H](": 189, "(N[C@H]2": 190, "(N[C@H]3": 191, "(Nc1": 192, "(Nc2": 193, "(Nc3": 194, "(Nc4": 195, "(Nc5": 196, "(Nn1": 197, "(Nn2": 198, "(O)(": 199, "(O)/": 200, "(O)=": 201, "(O)C": 202, "(O)N": 203, "(O)O": 204, "(O)[C@@H]": 205, "(O)[C@H]": 206, "(O)[C@]": 207, "(O)[nH]": 208, "(O)c": 209, "(O)n": 210, "(O/C": 211, "(O3)": 212, "(OC(": 213, "(OC)": 214, "(OC/": 215, "(OC1": 216, "(OC2": 217, "(OC3": 218, "(OC4": 219, "(OCC": 220, "(OC[C@@H]": 221, "(OCc": 222, "(O[C@@H]1": 223, "(O[C@H]2": 224, "(Oc1": 225, "(Oc2": 226, "(Oc3": 227, "(Oc4": 228, "(S(=": 229, "(S(C": 230, "(S(N": 231, "(SC)": 232, "(SC3": 233, "(SCC": 234, "(SCc": 235, "(Sc1": 236, "(Sc2": 237, "([C@@H](C": 238, "([C@@H](O": 239, "([C@@H]2C": 240, "([C@@]([H]": 241, "([C@H](O": 242, "([C@H]2C": 243, "([C@H]2O": 244, "([C@H]3C": 245, "([C@H]3O": 246, "([C@H]3c": 247, "([H])(": 248, "([H])C": 249, "([H])N": 250, "([H])[C@@H]": 251, "([H])[C@H]": 252, "([H])c": 253, "([N+](=": 254, "([O-])C": 255, "([O-])c": 256, "([nH]1)": 257, "([nH]2)": 258, "([nH]c2": 259, "([nH]c4": 260, "([nH]cn": 261, "([nH]n1": 262, "(\\C)": 263, "(\\CO": 264, "(\\F)": 265, "(\\N)": 266, "(\\N2": 267, "(\\NC": 268, "(\\O)": 269, "(\\c1": 270, "(c(-": 271, "(c(=": 272, "(c(Br": 273, "(c(C": 274, "(c(N": 275, "(c(O": 276, "(c(S": 277, "(c1)": 278, "(c1-": 279, "(c12": 280, "(c13": 281, "(c1=": 282, "(c1C": 283, "(c1Cl": 284, "(c1N": 285, "(c1O": 286, "(c1c": 287, "(c1n": 288, "(c1s": 289, "(c2)": 290, "(c2/": 291, "(c23": 292, "(c2=": 293, "(c2C": 294, "(c2Cl": 295, "(c2N": 296, "(c2O": 297, "(c2c": 298, "(c2n": 299, "(c3)": 300, "(c34": 301, "(c3C": 302, "(c3c": 303, "(c3n": 304, "(c3o": 305, "(c4)": 306, "(c41": 307, "(c4c": 308, "(c4n": 309, "(c4o": 310, "(c5)": 311, "(c5c": 312, "(c[n+](": 313, "(cc(": 314, "(cc1": 315, "(cc2": 316, "(cc3": 317, "(cc4": 318, "(ccc": 319, "(ccn": 320, "(cn1": 321, "(cnc": 322, "(cnn": 323, "(n(C": 324, "(n1)": 325, "(n1-": 326, "(n12": 327, "(n1c": 328, "(n2)": 329, "(n2-": 330, "(n2/": 331, "(n2C": 332, "(n2[nH]": 333, "(n2c": 334, "(n2n": 335, "(n3)": 336, "(n3c": 337, "(n4c": 338, "(n[nH]c": 339, "(nc(": 340, "(nc1": 341, "(nc2": 342, "(nc3": 343, "(nc5": 344, "(ncn": 345, "(nn1": 346, "(nn2": 347, "(nn3": 348, "(nnc": 349, "(nnn": 350, "(s1)": 351, "(s2)": 352, "(sc(": 353, "(sc2": 354, "(sc3": 355, "(sc4": 356, ")(/C": 357, ")(/N": 358, ")(=O": 359, ")(C(": 360, ")(C)": 361, ")(C2": 362, ")(C3": 363, ")(CC": 364, ")(CF": 365, ")(CN": 366, ")(CO": 367, ")(CS": 368, ")(Cc": 369, ")(Cn": 370, ")(F)": 371, ")(NC": 372, ")(Nc": 373, ")(O)": 374, ")(OC": 375, ")([C@@](": 376, ")([C@H]2": 377, ")([O-])": 378, ")(c1": 379, ")(c2": 380, ")(c3": 381, ")(c4": 382, ")-c1": 383, ")-n1": 384, ")-n2": 385, ")-n3": 386, ")/C(": 387, ")/C1": 388, ")/C=": 389, ")/N=": 390, ")=C(": 391, ")=C/": 392, ")=C1": 393, ")=C2": 394, ")=C3": 395, ")=CC": 396, ")=C\\": 397, ")=N/": 398, ")=N1": 399, ")=N2": 400, ")=NC": 401, ")=NN": 402, ")=NO": 403, ")=N\\": 404, ")=Nc": 405, ")=O)": 406, ")=c2": 407, ")C(=": 408, ")C(Br": 409, ")C(C": 410, ")C(F": 411, ")C(N": 412, ")C(O": 413, ")C(c": 414, ")C)(": 415, ")C)=": 416, ")C)C": 417, ")C)N": 418, ")C)O": 419, ")C)S": 420, ")C)[C@@H]": 421, ")C)[C@H]": 422, ")C)[nH]": 423, ")C)c": 424, ")C)n": 425, ")C)o": 426, ")C)s": 427, ")C/C": 428, ")C/N": 429, ")C1(": 430, ")C1)": 431, ")C12": 432, ")C1=": 433, ")C1C": 434, ")C1N": 435, ")C1O": 436, ")C1S": 437, ")C1c": 438, ")C2(": 439, ")C2)": 440, ")C21": 441, ")C23": 442, ")C2=": 443, ")C2C": 444, ")C2N": 445, ")C2O": 446, ")C2S": 447, ")C2c": 448, ")C3(": 449, ")C3)": 450, ")C31": 451, ")C3=": 452, ")C3C": 453, ")C3O": 454, ")C4)": 455, ")C4C": 456, ")C4c": 457, ")C5)": 458, ")C5=": 459, ")C5C": 460, ")C6=": 461, ")C=C": 462, ")C=N": 463, ")CC(": 464, ")CC)": 465, ")CC/": 466, ")CC1": 467, ")CC2": 468, ")CC3": 469, ")CC4": 470, ")CC5": 471, ")CC6": 472, ")CC=": 473, ")CCC": 474, ")CCN": 475, ")CCO": 476, ")CCS": 477, ")CC[C@@H]": 478, ")CC[C@@]": 479, ")CC[C@H]": 480, ")CC[C@]": 481, ")CCc": 482, ")CCn": 483, ")CF)": 484, ")CN(": 485, ")CN/": 486, ")CN1": 487, ")CN2": 488, ")CN3": 489, ")CNC": 490, ")CNS": 491, ")CN[C@H]": 492, ")CNc": 493, ")CO)": 494, ")CO/": 495, ")CO1": 496, ")CO2": 497, ")CO4": 498, ")COC": 499, ")CON": 500, ")COc": 501, ")CS(": 502, ")CSC": 503, ")CSc": 504, ")C[C@@H](": 505, ")C[C@@H]1": 506, ")C[C@@H]2": 507, ")C[C@@H]3": 508, ")C[C@@]1": 509, ")C[C@H](": 510, ")C[C@H]1": 511, ")C[C@H]2": 512, ")C[C@H]3": 513, ")C[C@]1": 514, ")C[C@]2": 515, ")C[C@]4": 516, ")C[N+](": 517, ")Cc1": 518, ")Cc2": 519, ")Cc3": 520, ")Cc4": 521, ")Cn1": 522, ")Cn2": 523, ")Cn3": 524, ")F)C": 525, ")F)N": 526, ")F)S": 527, ")F)[nH]": 528, ")F)c": 529, ")F)n": 530, ")F)o": 531, ")N(/": 532, ")N(C": 533, ")N(S": 534, ")N(c": 535, ")N)C": 536, ")N)[nH]": 537, ")N)c": 538, ")N1/": 539, ")N12": 540, ")N1C": 541, ")N1N": 542, ")N1O": 543, ")N1S": 544, ")N1c": 545, ")N2)": 546, ")N2C": 547, ")N2N": 548, ")N2O": 549, ")N2S": 550, ")N2c": 551, ")N3)": 552, ")N32": 553, ")N3C": 554, ")N4C": 555, ")N=C": 556, ")NC(": 557, ")NC)": 558, ")NC1": 559, ")NC2": 560, ")NC3": 561, ")NC4": 562, ")NCC": 563, ")NC[C@@H]": 564, ")NC[C@H]": 565, ")NCc": 566, ")NN(": 567, ")NN1": 568, ")NN2": 569, ")NN=": 570, ")NNc": 571, ")NOC": 572, ")NS(": 573, ")N[C@@H](": 574, ")N[C@@H]1": 575, ")N[C@@H]2": 576, ")N[C@H](": 577, ")N[C@H]1": 578, ")N[C@H]2": 579, ")N[C@H]3": 580, ")Nc1": 581, ")Nc2": 582, ")Nc3": 583, ")Nc4": 584, ")Nn1": 585, ")Nn2": 586, ")O)(": 587, ")O)=": 588, ")O)C": 589, ")O)N": 590, ")O)S": 591, ")O)[nH]": 592, ")O)c": 593, ")O)n": 594, ")O)o": 595, ")O)s": 596, ")O2)": 597, ")O3)": 598, ")O4)": 599, ")OC(": 600, ")OC)": 601, ")OC/": 602, ")OC1": 603, ")OC2": 604, ")OC3": 605, ")OCC": 606, ")OCO": 607, ")OC[C@H]": 608, ")OCc": 609, ")O[C@@H](": 610, ")O[C@@H]1": 611, ")O[C@@H]2": 612, ")O[C@@]1": 613, ")O[C@H](": 614, ")O[C@H]1": 615, ")O[C@H]3": 616, ")O[C@]1": 617, ")Oc1": 618, ")Oc2": 619, ")Oc3": 620, ")S(=": 621, ")S(C": 622, ")S/C": 623, ")S2(": 624, ")S4)": 625, ")SC(": 626, ")SC)": 627, ")SC2": 628, ")SCC": 629, ")[C@@H](C": 630, ")[C@@H](N": 631, ")[C@@H](O": 632, ")[C@@H](c": 633, ")[C@@H](n": 634, ")[C@@H]1C": 635, ")[C@@H]1O": 636, ")[C@@H]2C": 637, ")[C@@H]3C": 638, ")[C@@H]3O": 639, ")[C@@H]3[C@H]": 640, ")[C@@H]3c": 641, ")[C@@]([H]": 642, ")[C@@]1(": 643, ")[C@@]12": 644, ")[C@@]3(": 645, ")[C@@]32": 646, ")[C@H](/": 647, ")[C@H](C": 648, ")[C@H](N": 649, ")[C@H](O": 650, ")[C@H](c": 651, ")[C@H]1C": 652, ")[C@H]1O": 653, ")[C@H]2C": 654, ")[C@H]2c": 655, ")[C@H]3C": 656, ")[C@](C": 657, ")[C@](O": 658, ")[C@]([H]": 659, ")[C@]1(": 660, ")[C@]2(": 661, ")[C@]3(": 662, ")[O-])C": 663, ")[O-])c": 664, ")[O-])n": 665, ")[nH]/c": 666, ")[nH]1)": 667, ")[nH]2)": 668, ")[nH]3)": 669, ")[nH][nH]1": 670, ")[nH][nH]c": 671, ")[nH]c(": 672, ")[nH]c1": 673, ")[nH]c2": 674, ")[nH]c3": 675, ")[nH]c4": 676, ")[nH]cc": 677, ")[nH]cn": 678, ")[nH]n(": 679, ")[nH]n1": 680, ")[nH]n2": 681, ")[nH]n3": 682, ")[nH]n4": 683, ")[nH]nc": 684, ")\\CN": 685, ")\\c1": 686, ")c(-": 687, ")c(/": 688, ")c(=": 689, ")c(Br": 690, ")c(C": 691, ")c(Cl": 692, ")c(F": 693, ")c(I": 694, ")c(N": 695, ")c(O": 696, ")c(S": 697, ")c-2": 698, ")c1)": 699, ")c1-": 700, ")c1/": 701, ")c12": 702, ")c13": 703, ")c1=": 704, ")c1Br": 705, ")c1C": 706, ")c1Cl": 707, ")c1F": 708, ")c1I": 709, ")c1N": 710, ")c1O": 711, ")c1S": 712, ")c1[C@H]": 713, ")c1[nH]": 714, ")c1c": 715, ")c1n": 716, ")c1o": 717, ")c1s": 718, ")c2)": 719, ")c2-": 720, ")c2/": 721, ")c21": 722, ")c23": 723, ")c2=": 724, ")c2Br": 725, ")c2C": 726, ")c2Cl": 727, ")c2F": 728, ")c2N": 729, ")c2O": 730, ")c2S": 731, ")c2[nH]": 732, ")c2c": 733, ")c2n": 734, ")c2o": 735, ")c2s": 736, ")c3)": 737, ")c3-": 738, ")c32": 739, ")c34": 740, ")c3=": 741, ")c3C": 742, ")c3Cl": 743, ")c3F": 744, ")c3N": 745, ")c3O": 746, ")c3[C@H]": 747, ")c3[nH]": 748, ")c3c": 749, ")c3n": 750, ")c3o": 751, ")c3s": 752, ")c4)": 753, ")c4C": 754, ")c4O": 755, ")c4[nH]": 756, ")c4c": 757, ")c4n": 758, ")c5)": 759, ")c5C": 760, ")c5c": 761, ")c5n": 762, ")c5s": 763, ")c[nH]1": 764, ")c[nH]2": 765, ")c[nH]3": 766, ")c[nH]c": 767, ")cc(": 768, ")cc/": 769, ")cc1": 770, ")cc2": 771, ")cc3": 772, ")cc4": 773, ")cc5": 774, ")cc6": 775, ")cc[nH]": 776, ")ccc": 777, ")ccn": 778, ")cn(": 779, ")cn1": 780, ")cn2": 781, ")cn3": 782, ")cn4": 783, ")cnc": 784, ")cnn": 785, ")coc": 786, ")cs1": 787, ")cs2": 788, ")cs3": 789, ")cs4": 790, ")csc": 791, ")n(-": 792, ")n(C": 793, ")n(N": 794, ")n(S": 795, ")n([C@H]": 796, ")n/c": 797, ")n1)": 798, ")n1-": 799, ")n1/": 800, ")n12": 801, ")n1C": 802, ")n1S": 803, ")n1[nH]": 804, ")n1c": 805, ")n1n": 806, ")n2)": 807, ")n2-": 808, ")n21": 809, ")n23": 810, ")n2C": 811, ")n2O": 812, ")n2c": 813, ")n2n": 814, ")n2o": 815, ")n3)": 816, ")n32": 817, ")n3C": 818, ")n3[C@@]": 819, ")n3c": 820, ")n3n": 821, ")n3o": 822, ")n4)": 823, ")n4C": 824, ")n4c": 825, ")n4n": 826, ")n[nH]1": 827, ")n[nH]2": 828, ")n[nH]3": 829, ")n[nH]4": 830, ")n[nH]c": 831, ")nc(": 832, ")nc1": 833, ")nc2": 834, ")nc3": 835, ")nc4": 836, ")nc5": 837, ")nc[nH]": 838, ")ncc": 839, ")ncn": 840, ")nn(": 841, ")nn1": 842, ")nn2": 843, ")nn3": 844, ")nn4": 845, ")nnc": 846, ")nnn": 847, ")no1": 848, ")no2": 849, ")no3": 850, ")noc": 851, ")o1)": 852, ")o2)": 853, ")o3)": 854, ")o4)": 855, ")oc(": 856, ")oc1": 857, ")oc2": 858, ")oc3": 859, ")oc4": 860, ")on1": 861, ")on2": 862, ")on3": 863, ")on4": 864, ")onc": 865, ")s1)": 866, ")s2)": 867, ")s3)": 868, ")s4)": 869, ")sc(": 870, ")sc1": 871, ")sc2": 872, ")sc3": 873, ")sc4": 874, ")scc": 875, "-2)C": 876, "-2)n": 877, "-2nc": 878, "-3)c": 879, "-3)o": 880, "-3c2": 881, "-4)c": 882, "-c1[nH]": 883, "-c1c": 884, "-c1n": 885, "-c1o": 886, "-c2[nH]": 887, "-c2c": 888, "-c2n": 889, "-c2o": 890, "-c2s": 891, "-c3c": 892, "-c3n": 893, "-c3s": 894, "-c4c": 895, "-c4n": 896, "-c4s": 897, "-c5c": 898, "-c6c": 899, "-n1c": 900, "-n1n": 901, "-n2c": 902, "-n2n": 903, "-n3c": 904, "-n3n": 905, "-n4c": 906, "-n4n": 907, "/4)c": 908, "/C#N": 909, "/C(=": 910, "/C(Br": 911, "/C(C": 912, "/C(F": 913, "/C(N": 914, "/C)N": 915, "/C)c": 916, "/C1(": 917, "/C1=": 918, "/C2=": 919, "/C=C": 920, "/C=N": 921, "/CCC": 922, "/CN(": 923, "/CN1": 924, "/COC": 925, "/COc": 926, "/Cc1": 927, "/Cc2": 928, "/Cn1": 929, "/F)O": 930, "/N(C": 931, "/N(c": 932, "/N=C": 933, "/N=c": 934, "/Nc2": 935, "/O)c": 936, "/OC)": 937, "/S(=": 938, "/[nH]cn": 939, "/c(=": 940, "/c1=": 941, "/c1c": 942, "/c1n": 943, "/c2c": 944, "/c2n": 945, "/c2o": 946, "/c3c": 947, "/c3n": 948, "/c4c": 949, "/c5c": 950, "/n1c": 951, "/n2c": 952, "/n3c": 953, "/nc(": 954, "/ncc": 955, "/o[nH]c": 956, "1(=O": 957, "1(C(": 958, "1(C)": 959, "1(CC": 960, "1(CN": 961, "1(CO": 962, "1(Cc": 963, "1(Cn": 964, "1(F)": 965, "1(N)": 966, "1(N2": 967, "1(NC": 968, "1(O)": 969, "1([C@@H](": 970, "1([C@H](": 971, "1([H])": 972, "1(c1": 973, "1(c2": 974, "1(c3": 975, "1)(C": 976, "1)(N": 977, "1)(c": 978, "1)-c": 979, "1)=C": 980, "1)C(": 981, "1)C1": 982, "1)C2": 983, "1)C3": 984, "1)C=": 985, "1)CC": 986, "1)CN": 987, "1)CO": 988, "1)CS": 989, "1)C[C@@H]": 990, "1)C[C@H]": 991, "1)Cc": 992, "1)Cn": 993, "1)N(": 994, "1)N1": 995, "1)N2": 996, "1)N=": 997, "1)NC": 998, "1)NN": 999, "1)N[C@@H]": 1000, "1)N[C@H]": 1001, "1)Nc": 1002, "1)O2": 1003, "1)O3": 1004, "1)OC": 1005, "1)O[C@@H]": 1006, "1)O[C@H]": 1007, "1)Oc": 1008, "1)S(": 1009, "1)S2": 1010, "1)[C@@H](": 1011, "1)[C@@H]1": 1012, "1)[C@@H]3": 1013, "1)[C@H](": 1014, "1)[nH]c": 1015, "1)\\C": 1016, "1)\\c": 1017, "1)c(": 1018, "1)c1": 1019, "1)cc": 1020, "1)cn": 1021, "1)n(": 1022, "1)n1": 1023, "1)n2": 1024, "1)nc": 1025, "1)nn": 1026, "1)oc": 1027, "1-2)": 1028, "1-c1": 1029, "1-n1": 1030, "1/C(": 1031, "1/C=": 1032, "1/N=": 1033, "1/[nH]c": 1034, "1/c(": 1035, "12)(": 1036, "12)-": 1037, "12)C": 1038, "12)N": 1039, "12)O": 1040, "12)c": 1041, "12)n": 1042, "12C(": 1043, "12C=": 1044, "12CC": 1045, "12CN": 1046, "12CO": 1047, "12C[C@@H]": 1048, "12C[C@H]": 1049, "12Cc": 1050, "12NC": 1051, "12OC": 1052, "12Oc": 1053, "12c3": 1054, "13)C": 1055, "13)N": 1056, "13)S": 1057, "13C=": 1058, "1=C(": 1059, "1=C/": 1060, "1=C2": 1061, "1=CC": 1062, "1=CO": 1063, "1=C\\": 1064, "1=Cc": 1065, "1=Cn": 1066, "1=N/": 1067, "1=N2": 1068, "1=NC": 1069, "1=NN": 1070, "1=NO": 1071, "1=NS": 1072, "1=N\\": 1073, "1=Nc": 1074, "1=O)": 1075, "1Br)C": 1076, "1Br)c": 1077, "1Br)n": 1078, "1C#C": 1079, "1C#N": 1080, "1C(=": 1081, "1C(C": 1082, "1C(F": 1083, "1C(N": 1084, "1C(O": 1085, "1C(S": 1086, "1C(c": 1087, "1C)C": 1088, "1C)N": 1089, "1C)O": 1090, "1C)c": 1091, "1C)n": 1092, "1C)s": 1093, "1C/C": 1094, "1C1(": 1095, "1C12": 1096, "1C1=": 1097, "1C1C": 1098, "1C1N": 1099, "1C1c": 1100, "1C2(": 1101, "1C2)": 1102, "1C2=": 1103, "1C2C": 1104, "1C=C": 1105, "1C=O": 1106, "1CC(": 1107, "1CC/": 1108, "1CC1": 1109, "1CC2": 1110, "1CC=": 1111, "1CCC": 1112, "1CCN": 1113, "1CCO": 1114, "1CCS": 1115, "1CC[C@@H]": 1116, "1CC[C@@]": 1117, "1CC[C@H]": 1118, "1CCc": 1119, "1CCn": 1120, "1CN(": 1121, "1CN1": 1122, "1CN2": 1123, "1CNC": 1124, "1CNc": 1125, "1CO)": 1126, "1COC": 1127, "1CON": 1128, "1COc": 1129, "1CS(": 1130, "1CS/": 1131, "1CSC": 1132, "1C[C@@H](": 1133, "1C[C@@H]2": 1134, "1C[C@@]2": 1135, "1C[C@H](": 1136, "1C[C@H]2": 1137, "1Cc1": 1138, "1Cc2": 1139, "1Cl)C": 1140, "1Cl)N": 1141, "1Cl)O": 1142, "1Cl)S": 1143, "1Cl)c": 1144, "1Cl)n": 1145, "1Cn1": 1146, "1Cn2": 1147, "1F)C": 1148, "1F)N": 1149, "1F)O": 1150, "1F)c": 1151, "1N(C": 1152, "1N(c": 1153, "1N)O": 1154, "1N)c": 1155, "1N/C": 1156, "1N1C": 1157, "1N2C": 1158, "1N=C": 1159, "1NC(": 1160, "1NC1": 1161, "1NC2": 1162, "1NCC": 1163, "1NCc": 1164, "1NN=": 1165, "1NS(": 1166, "1N[C@@H](": 1167, "1Nc1": 1168, "1Nc2": 1169, "1O)=": 1170, "1O)C": 1171, "1O/C": 1172, "1OC(": 1173, "1OC)": 1174, "1OC1": 1175, "1OC2": 1176, "1OC3": 1177, "1OCC": 1178, "1OCO": 1179, "1OCc": 1180, "1OS(": 1181, "1O[C@@H](": 1182, "1O[C@@]2": 1183, "1O[C@H](": 1184, "1O[C@H]1": 1185, "1Oc1": 1186, "1S(=": 1187, "1S(N": 1188, "1S2(": 1189, "1S2=": 1190, "1SC(": 1191, "1SC2": 1192, "1SCC": 1193, "1Sc1": 1194, "1[C@@H](C": 1195, "1[C@@H](N": 1196, "1[C@H](N": 1197, "1[C@H](O": 1198, "1[C@H]1C": 1199, "1[N+](=": 1200, "1[nH]/c": 1201, "1[nH]c(": 1202, "1[nH]c1": 1203, "1[nH]c2": 1204, "1[nH]cc": 1205, "1[nH]cn": 1206, "1[nH]nc": 1207, "1\\C(": 1208, "1\\N(": 1209, "1\\NC": 1210, "1\\Nc": 1211, "1\\ON": 1212, "1\\S/": 1213, "1\\[nH]c": 1214, "1\\[nH]n": 1215, "1\\n(": 1216, "1c(-": 1217, "1c(/": 1218, "1c(=": 1219, "1c(Br": 1220, "1c(C": 1221, "1c(Cl": 1222, "1c(F": 1223, "1c(I": 1224, "1c(N": 1225, "1c(O": 1226, "1c(S": 1227, "1c(c": 1228, "1c(n": 1229, "1c-2": 1230, "1c1c": 1231, "1c1n": 1232, "1c1s": 1233, "1c2-": 1234, "1c23": 1235, "1c2[nH]": 1236, "1c2c": 1237, "1c2n": 1238, "1c2s": 1239, "1c32": 1240, "1c3c": 1241, "1c3n": 1242, "1c[nH]c": 1243, "1c[nH]n": 1244, "1cc(": 1245, "1cc1": 1246, "1cc2": 1247, "1cc3": 1248, "1cc[nH]": 1249, "1ccc": 1250, "1ccn": 1251, "1cco": 1252, "1ccs": 1253, "1cn(": 1254, "1cn/": 1255, "1cn2": 1256, "1cn3": 1257, "1cn[nH]": 1258, "1cnc": 1259, "1cnn": 1260, "1coc": 1261, "1csc": 1262, "1n(C": 1263, "1n1c": 1264, "1n2C": 1265, "1n[nH]c": 1266, "1nc(": 1267, "1nc1": 1268, "1nc2": 1269, "1nc3": 1270, "1nc[nH]": 1271, "1ncc": 1272, "1ncn": 1273, "1nco": 1274, "1ncs": 1275, "1nn(": 1276, "1nn2": 1277, "1nn3": 1278, "1nn[nH]": 1279, "1nnc": 1280, "1nnn": 1281, "1nns": 1282, "1noc": 1283, "1oc(": 1284, "1oc1": 1285, "1oc2": 1286, "1occ": 1287, "1onc": 1288, "1s/c": 1289, "1sc(": 1290, "1sc1": 1291, "1sc2": 1292, "1scc": 1293, "2(=O": 1294, "2(C(": 1295, "2(C)": 1296, "2(CC": 1297, "2(CN": 1298, "2(NC": 1299, "2(NS": 1300, "2(O)": 1301, "2(OC": 1302, "2([H])": 1303, "2(c3": 1304, "2)(C": 1305, "2)([C@H]": 1306, "2)(c": 1307, "2)-c": 1308, "2)=C": 1309, "2)=N": 1310, "2)C(": 1311, "2)C1": 1312, "2)C2": 1313, "2)C3": 1314, "2)C=": 1315, "2)CC": 1316, "2)CN": 1317, "2)CO": 1318, "2)CS": 1319, "2)C[C@@H]": 1320, "2)C[C@@]": 1321, "2)C[C@H]": 1322, "2)Cc": 1323, "2)Cn": 1324, "2)N(": 1325, "2)N1": 1326, "2)N2": 1327, "2)N=": 1328, "2)NC": 1329, "2)Nc": 1330, "2)O1": 1331, "2)O3": 1332, "2)OC": 1333, "2)Oc": 1334, "2)S(": 1335, "2)SC": 1336, "2)[C@@H]1": 1337, "2)[C@@H]2": 1338, "2)[C@@](": 1339, "2)[C@@]1": 1340, "2)[C@H](": 1341, "2)[C@H]1": 1342, "2)[C@H]2": 1343, "2)[C@](": 1344, "2)[nH]1": 1345, "2)[nH]c": 1346, "2)[nH]n": 1347, "2)c(": 1348, "2)c1": 1349, "2)c2": 1350, "2)c[nH]": 1351, "2)cc": 1352, "2)cn": 1353, "2)cs": 1354, "2)n(": 1355, "2)n1": 1356, "2)n2": 1357, "2)n[nH]": 1358, "2)nc": 1359, "2)nn": 1360, "2)no": 1361, "2)o1": 1362, "2)oc": 1363, "2)on": 1364, "2)s1": 1365, "2)sc": 1366, "2-3)": 1367, "2-c1": 1368, "2-c2": 1369, "2-n2": 1370, "2/C1": 1371, "2/C=": 1372, "2/CC": 1373, "2/N=": 1374, "2/c(": 1375, "2/nc": 1376, "21)C": 1377, "21)N": 1378, "21)O": 1379, "21)[nH]": 1380, "21)c": 1381, "21C(": 1382, "21CC": 1383, "23)(": 1384, "23)C": 1385, "23)N": 1386, "23)O": 1387, "23)[nH]": 1388, "23)c": 1389, "23)n": 1390, "23)o": 1391, "23)s": 1392, "23C1": 1393, "23CC": 1394, "24)C": 1395, "2=C(": 1396, "2=C1": 1397, "2=CC": 1398, "2=CN": 1399, "2=Cc": 1400, "2=N)": 1401, "2=N1": 1402, "2=NC": 1403, "2=NN": 1404, "2=NO": 1405, "2=NS": 1406, "2=Nc": 1407, "2=O)": 1408, "2=S)": 1409, "2Br)C": 1410, "2Br)N": 1411, "2Br)c": 1412, "2Br)n": 1413, "2C#N": 1414, "2C(=": 1415, "2C(C": 1416, "2C(F": 1417, "2C(N": 1418, "2C(O": 1419, "2C(c": 1420, "2C)C": 1421, "2C)O": 1422, "2C)S": 1423, "2C)[nH]": 1424, "2C)c": 1425, "2C)n": 1426, "2C)o": 1427, "2C)s": 1428, "2C/C": 1429, "2C1(": 1430, "2C1)": 1431, "2C12": 1432, "2C1=": 1433, "2C1C": 1434, "2C1c": 1435, "2C2(": 1436, "2C2=": 1437, "2C2C": 1438, "2C3(": 1439, "2C3)": 1440, "2C3C": 1441, "2C4C": 1442, "2C=C": 1443, "2C=N": 1444, "2CC(": 1445, "2CC)": 1446, "2CC/": 1447, "2CC1": 1448, "2CC2": 1449, "2CC3": 1450, "2CC=": 1451, "2CCC": 1452, "2CCN": 1453, "2CCO": 1454, "2CCS": 1455, "2CC[C@@H]": 1456, "2CC[C@H]": 1457, "2CC[C@]": 1458, "2CC[N@@+]": 1459, "2CCc": 1460, "2CCn": 1461, "2CN(": 1462, "2CN1": 1463, "2CN2": 1464, "2CNC": 1465, "2CNc": 1466, "2CO1": 1467, "2COC": 1468, "2CO[C@@H]": 1469, "2COc": 1470, "2CS(": 1471, "2C[C@@H](": 1472, "2C[C@@H]1": 1473, "2C[C@@H]3": 1474, "2C[C@H](": 1475, "2C[C@H]3": 1476, "2Cc1": 1477, "2Cc2": 1478, "2Cc3": 1479, "2Cl)C": 1480, "2Cl)N": 1481, "2Cl)O": 1482, "2Cl)S": 1483, "2Cl)[C@H]": 1484, "2Cl)[nH]": 1485, "2Cl)c": 1486, "2Cl)n": 1487, "2Cl)o": 1488, "2Cn2": 1489, "2Cn3": 1490, "2F)C": 1491, "2F)c": 1492, "2F)n": 1493, "2F)o": 1494, "2N(C": 1495, "2N)C": 1496, "2N)c": 1497, "2N)n": 1498, "2N1)": 1499, "2N1C": 1500, "2N1S": 1501, "2N1c": 1502, "2N2C": 1503, "2N=C": 1504, "2NC(": 1505, "2NC1": 1506, "2NC2": 1507, "2NC3": 1508, "2NCC": 1509, "2NCc": 1510, "2NN(": 1511, "2NS(": 1512, "2Nc2": 1513, "2Nc3": 1514, "2O)C": 1515, "2O)N": 1516, "2O)c": 1517, "2O)n": 1518, "2O1)": 1519, "2O3)": 1520, "2OC(": 1521, "2OC)": 1522, "2OC1": 1523, "2OC=": 1524, "2OCC": 1525, "2OCO": 1526, "2OCc": 1527, "2O[C@@H]1": 1528, "2O[C@]2": 1529, "2Oc1": 1530, "2Oc2": 1531, "2Oc3": 1532, "2S(=": 1533, "2S(C": 1534, "2S/C": 1535, "2S1(": 1536, "2S3(": 1537, "2S3=": 1538, "2SCO": 1539, "2SCc": 1540, "2Sc2": 1541, "2[C@@H](N": 1542, "2[C@@H]2c": 1543, "2[C@H](C": 1544, "2[C@H](N": 1545, "2[C@H]1C": 1546, "2[C@H]1N": 1547, "2[C@H]1c": 1548, "2[C@H]2O": 1549, "2[C@]2(": 1550, "2[H])C": 1551, "2[O-])c": 1552, "2[nH]1)": 1553, "2[nH]c(": 1554, "2[nH]c1": 1555, "2[nH]c2": 1556, "2[nH]c3": 1557, "2[nH]cc": 1558, "2[nH]cn": 1559, "2[nH]n(": 1560, "2[nH]nc": 1561, "2[nH]nn": 1562, "2[se]n1": 1563, "2\\C(": 1564, "2\\CC": 1565, "2\\Nc": 1566, "2\\OC": 1567, "2\\Oc": 1568, "2\\SC": 1569, "2\\[nH]n": 1570, "2\\c(": 1571, "2\\cc": 1572, "2\\nc": 1573, "2\\sc": 1574, "2c(-": 1575, "2c(/": 1576, "2c(=": 1577, "2c(Br": 1578, "2c(C": 1579, "2c(Cl": 1580, "2c(F": 1581, "2c(N": 1582, "2c(O": 1583, "2c(S": 1584, "2c([C@H]": 1585, "2c([nH]": 1586, "2c(c": 1587, "2c(n": 1588, "2c(s": 1589, "2c1)": 1590, "2c1-": 1591, "2c1=": 1592, "2c1Br": 1593, "2c1C": 1594, "2c1Cl": 1595, "2c1N": 1596, "2c1O": 1597, "2c1[C@H]": 1598, "2c1[N+]": 1599, "2c1[nH]": 1600, "2c1c": 1601, "2c1n": 1602, "2c1o": 1603, "2c1s": 1604, "2c2c": 1605, "2c2n": 1606, "2c34": 1607, "2c3c": 1608, "2c3n": 1609, "2c3o": 1610, "2c3s": 1611, "2c43": 1612, "2c[nH]c": 1613, "2cc(": 1614, "2cc1": 1615, "2cc3": 1616, "2cc[nH]": 1617, "2ccc": 1618, "2ccn": 1619, "2cco": 1620, "2ccs": 1621, "2cn(": 1622, "2cn1": 1623, "2cn3": 1624, "2cn[nH]": 1625, "2cnc": 1626, "2cnn": 1627, "2coc": 1628, "2csc": 1629, "2n(C": 1630, "2n(c": 1631, "2n(n": 1632, "2n/c": 1633, "2n1)": 1634, "2n1-": 1635, "2n1C": 1636, "2n1S": 1637, "2n2/": 1638, "2n2c": 1639, "2n2n": 1640, "2n[nH]c": 1641, "2n[se]n": 1642, "2nc(": 1643, "2nc1": 1644, "2nc2": 1645, "2nc3": 1646, "2nc[nH]": 1647, "2ncc": 1648, "2ncn": 1649, "2nn(": 1650, "2nn3": 1651, "2nn[nH]": 1652, "2nnc": 1653, "2nnn": 1654, "2nno": 1655, "2noc": 1656, "2non": 1657, "2nsc": 1658, "2o/c": 1659, "2oc(": 1660, "2oc1": 1661, "2oc3": 1662, "2occ": 1663, "2ocn": 1664, "2onc": 1665, "2s1)": 1666, "2sc(": 1667, "2sc3": 1668, "2scc": 1669, "2scn": 1670, "3(=O": 1671, "3(C#": 1672, "3(C(": 1673, "3(C)": 1674, "3(C2": 1675, "3(CC": 1676, "3(Cc": 1677, "3(NC": 1678, "3(O)": 1679, "3([H])": 1680, "3(c4": 1681, "3)(O": 1682, "3)(c": 1683, "3)-n": 1684, "3)=C": 1685, "3)=N": 1686, "3)C(": 1687, "3)C1": 1688, "3)C2": 1689, "3)C3": 1690, "3)C4": 1691, "3)C=": 1692, "3)CC": 1693, "3)CN": 1694, "3)CO": 1695, "3)C[C@@H]": 1696, "3)C[C@H]": 1697, "3)C[C@]": 1698, "3)Cc": 1699, "3)N(": 1700, "3)N1": 1701, "3)N2": 1702, "3)N3": 1703, "3)N=": 1704, "3)NC": 1705, "3)Nc": 1706, "3)O2": 1707, "3)OC": 1708, "3)O[C@]": 1709, "3)Oc": 1710, "3)S(": 1711, "3)SC": 1712, "3)[C@@H](": 1713, "3)[C@@H]2": 1714, "3)[C@@]1": 1715, "3)[C@]3": 1716, "3)[nH]/": 1717, "3)[nH]2": 1718, "3)[nH]c": 1719, "3)[nH]n": 1720, "3)c(": 1721, "3)c1": 1722, "3)c2": 1723, "3)c3": 1724, "3)c[nH]": 1725, "3)cc": 1726, "3)cn": 1727, "3)cs": 1728, "3)n(": 1729, "3)n1": 1730, "3)n2": 1731, "3)n3": 1732, "3)n[nH]": 1733, "3)nc": 1734, "3)nn": 1735, "3)no": 1736, "3)o1": 1737, "3)o2": 1738, "3)oc": 1739, "3)on": 1740, "3)s1": 1741, "3)s2": 1742, "3)sc": 1743, "3-2)": 1744, "3-4)": 1745, "3-c2": 1746, "3-c3": 1747, "3-n3": 1748, "3/C(": 1749, "3/c(": 1750, "31)C": 1751, "31)N": 1752, "31C(": 1753, "31C[C@H]": 1754, "32)=": 1755, "32)C": 1756, "32)O": 1757, "32)[nH]": 1758, "32)c": 1759, "32)n": 1760, "32)o": 1761, "32)s": 1762, "32[C@]2": 1763, "32[H])": 1764, "34)C": 1765, "34)c": 1766, "34)n": 1767, "34CC": 1768, "35)C": 1769, "3=C(": 1770, "3=C2": 1771, "3=CC": 1772, "3=C[C@H]": 1773, "3=Cc": 1774, "3=NC": 1775, "3=O)": 1776, "3Br)c": 1777, "3Br)n": 1778, "3C#N": 1779, "3C(=": 1780, "3C(C": 1781, "3C(F": 1782, "3C)C": 1783, "3C)N": 1784, "3C)O": 1785, "3C)c": 1786, "3C)n": 1787, "3C)o": 1788, "3C1(": 1789, "3C12": 1790, "3C1C": 1791, "3C2)": 1792, "3C2=": 1793, "3C2C": 1794, "3C2O": 1795, "3C2c": 1796, "3C3=": 1797, "3C3C": 1798, "3C4)": 1799, "3C=C": 1800, "3CC(": 1801, "3CC)": 1802, "3CC1": 1803, "3CC2": 1804, "3CC3": 1805, "3CC4": 1806, "3CC5": 1807, "3CC=": 1808, "3CCC": 1809, "3CCN": 1810, "3CCO": 1811, "3CCS": 1812, "3CC[C@@H]": 1813, "3CC[C@@]": 1814, "3CC[C@H]": 1815, "3CC[C@]": 1816, "3CCc": 1817, "3CN1": 1818, "3CN2": 1819, "3CN3": 1820, "3CNC": 1821, "3CO)": 1822, "3COC": 1823, "3COc": 1824, "3CS(": 1825, "3CSC": 1826, "3C[C@@H](": 1827, "3C[C@@H]2": 1828, "3C[C@@](": 1829, "3C[C@H](": 1830, "3C[C@H]2": 1831, "3C[C@H]4": 1832, "3Cc1": 1833, "3Cc3": 1834, "3Cc4": 1835, "3Cl)C": 1836, "3Cl)c": 1837, "3Cl)n": 1838, "3Cl)o": 1839, "3F)C": 1840, "3F)N": 1841, "3F)[C@@H]": 1842, "3F)c": 1843, "3F)n": 1844, "3F)o": 1845, "3N)c": 1846, "3N)n": 1847, "3N)o": 1848, "3N12": 1849, "3N2)": 1850, "3N2O": 1851, "3N2S": 1852, "3N3C": 1853, "3NC(": 1854, "3NC2": 1855, "3NC3": 1856, "3NCC": 1857, "3Nc3": 1858, "3O)C": 1859, "3O)c": 1860, "3O)n": 1861, "3O)o": 1862, "3O2)": 1863, "3OC)": 1864, "3OC2": 1865, "3OC3": 1866, "3OCC": 1867, "3OCO": 1868, "3OCc": 1869, "3O[C@@H](": 1870, "3O[C@@H]2": 1871, "3O[C@]3": 1872, "3Oc3": 1873, "3S(=": 1874, "3S(C": 1875, "3S(N": 1876, "3S2(": 1877, "3[C@@H](C": 1878, "3[C@@H]3C": 1879, "3[C@@]1(": 1880, "3[C@H](C": 1881, "3[C@H](c": 1882, "3[C@H]2C": 1883, "3[C@]1(": 1884, "3[N+](=": 1885, "3[nH]1)": 1886, "3[nH]2)": 1887, "3[nH]c(": 1888, "3[nH]c2": 1889, "3[nH]c3": 1890, "3[nH]c4": 1891, "3[nH]cc": 1892, "3[nH]cn": 1893, "3[nH]nc": 1894, "3\\C=": 1895, "3c(-": 1896, "3c(=": 1897, "3c(Br": 1898, "3c(C": 1899, "3c(Cl": 1900, "3c(F": 1901, "3c(N": 1902, "3c(O": 1903, "3c(S": 1904, "3c([nH]": 1905, "3c(c": 1906, "3c(n": 1907, "3c(s": 1908, "3c12": 1909, "3c1C": 1910, "3c1O": 1911, "3c1c": 1912, "3c2)": 1913, "3c2-": 1914, "3c21": 1915, "3c2=": 1916, "3c2Br": 1917, "3c2C": 1918, "3c2Cl": 1919, "3c2F": 1920, "3c2N": 1921, "3c2O": 1922, "3c2[nH]": 1923, "3c2c": 1924, "3c2n": 1925, "3c2o": 1926, "3c2s": 1927, "3c3c": 1928, "3c3n": 1929, "3c3s": 1930, "3c4c": 1931, "3c[nH]c": 1932, "3c[nH]n": 1933, "3cc(": 1934, "3cc2": 1935, "3cc4": 1936, "3cc[nH]": 1937, "3ccc": 1938, "3ccn": 1939, "3cco": 1940, "3ccs": 1941, "3cn(": 1942, "3cn2": 1943, "3cn4": 1944, "3cn[nH]": 1945, "3cnc": 1946, "3cnn": 1947, "3csc": 1948, "3n(C": 1949, "3n(c": 1950, "3n(n": 1951, "3n1)": 1952, "3n12": 1953, "3n2)": 1954, "3n2-": 1955, "3n21": 1956, "3n2C": 1957, "3n2c": 1958, "3n3c": 1959, "3n3n": 1960, "3n[nH]c": 1961, "3nc(": 1962, "3nc1": 1963, "3nc2": 1964, "3nc3": 1965, "3nc4": 1966, "3nc[nH]": 1967, "3ncc": 1968, "3ncn": 1969, "3nco": 1970, "3nn(": 1971, "3nn2": 1972, "3nn4": 1973, "3nn[nH]": 1974, "3nnc": 1975, "3nnn": 1976, "3noc": 1977, "3o2)": 1978, "3oc(": 1979, "3oc2": 1980, "3oc4": 1981, "3occ": 1982, "3onc": 1983, "3s1)": 1984, "3s2)": 1985, "3sc(": 1986, "3sc4": 1987, "3scc": 1988, "4(C)": 1989, "4(C=": 1990, "4(CC": 1991, "4)(c": 1992, "4)-n": 1993, "4)=C": 1994, "4)=N": 1995, "4)C1": 1996, "4)C2": 1997, "4)C3": 1998, "4)CC": 1999, "4)C[C@H]": 2000, "4)N=": 2001, "4)OC": 2002, "4)[C@@H]3": 2003, "4)[C@H](": 2004, "4)[nH]2": 2005, "4)[nH]c": 2006, "4)c(": 2007, "4)c1": 2008, "4)c2": 2009, "4)c3": 2010, "4)c4": 2011, "4)c[nH]": 2012, "4)cc": 2013, "4)cn": 2014, "4)cs": 2015, "4)n(": 2016, "4)n1": 2017, "4)n2": 2018, "4)n3": 2019, "4)n[nH]": 2020, "4)nc": 2021, "4)nn": 2022, "4)no": 2023, "4)o3": 2024, "4)oc": 2025, "4)on": 2026, "4)s3": 2027, "4-c3": 2028, "4-c4": 2029, "4/o[nH]": 2030, "41)O": 2031, "42)C": 2032, "43)C": 2033, "43)N": 2034, "43)O": 2035, "43)[nH]": 2036, "43)c": 2037, "43)n": 2038, "43)s": 2039, "45)N": 2040, "45)c": 2041, "45)n": 2042, "4=N3": 2043, "4=Nc": 2044, "4=O)": 2045, "4C#N": 2046, "4C(=": 2047, "4C)C": 2048, "4C)c": 2049, "4C)n": 2050, "4C)o": 2051, "4C2(": 2052, "4C3)": 2053, "4C3=": 2054, "4C3c": 2055, "4C5(": 2056, "4C=N": 2057, "4CC(": 2058, "4CC4": 2059, "4CC5": 2060, "4CC=": 2061, "4CCC": 2062, "4CCN": 2063, "4CCO": 2064, "4CCS": 2065, "4CCc": 2066, "4CCn": 2067, "4CN(": 2068, "4CNC": 2069, "4COC": 2070, "4COc": 2071, "4C[C@@H](": 2072, "4Cl)C": 2073, "4Cl)N": 2074, "4Cl)c": 2075, "4Cl)n": 2076, "4F)C": 2077, "4F)c": 2078, "4F)n": 2079, "4N1)": 2080, "4O3)": 2081, "4OC(": 2082, "4OC)": 2083, "4OC3": 2084, "4Oc4": 2085, "4S(=": 2086, "4[C@]2(": 2087, "4[nH]3)": 2088, "4[nH]c(": 2089, "4[nH]cc": 2090, "4[nH]cn": 2091, "4[nH]nc": 2092, "4c(-": 2093, "4c(/": 2094, "4c(=": 2095, "4c(C": 2096, "4c(Cl": 2097, "4c(N": 2098, "4c(O": 2099, "4c(c": 2100, "4c(n": 2101, "4c(s": 2102, "4c2)": 2103, "4c23": 2104, "4c2c": 2105, "4c3)": 2106, "4c31": 2107, "4c32": 2108, "4c3=": 2109, "4c3C": 2110, "4c3N": 2111, "4c3O": 2112, "4c3[nH]": 2113, "4c3c": 2114, "4c3n": 2115, "4c4c": 2116, "4c4n": 2117, "4c5c": 2118, "4c[nH]c": 2119, "4cc(": 2120, "4cc3": 2121, "4cc5": 2122, "4cc[nH]": 2123, "4ccc": 2124, "4ccn": 2125, "4ccs": 2126, "4cn(": 2127, "4cn[nH]": 2128, "4cnc": 2129, "4cnn": 2130, "4n(C": 2131, "4n(c": 2132, "4n23": 2133, "4n3)": 2134, "4n32": 2135, "4n3C": 2136, "4n3c": 2137, "4n5C": 2138, "4n[nH]c": 2139, "4nc(": 2140, "4nc2": 2141, "4nc3": 2142, "4nc4": 2143, "4nc5": 2144, "4nc[nH]": 2145, "4ncc": 2146, "4ncn": 2147, "4nnc": 2148, "4nnn": 2149, "4noc": 2150, "4o3)": 2151, "4oc(": 2152, "4occ": 2153, "4s3)": 2154, "4sc(": 2155, "4scc": 2156, "5(C)": 2157, "5(CC": 2158, "5)C(": 2159, "5)C3": 2160, "5)C4": 2161, "5)CC": 2162, "5)CN": 2163, "5)N(": 2164, "5)NC": 2165, "5)c(": 2166, "5)c1": 2167, "5)c2": 2168, "5)c3": 2169, "5)c4": 2170, "5)cc": 2171, "5)cn": 2172, "5)cs": 2173, "5)n(": 2174, "5)n3": 2175, "5)n4": 2176, "5)n[nH]": 2177, "5)nc": 2178, "5)nn": 2179, "5)o2": 2180, "5)o3": 2181, "5)o4": 2182, "5)oc": 2183, "54)C": 2184, "54)c": 2185, "54)n": 2186, "56)n": 2187, "5=O)": 2188, "5C)C": 2189, "5C)n": 2190, "5C3c": 2191, "5C4)": 2192, "5C5C": 2193, "5CC(": 2194, "5CCC": 2195, "5CCN": 2196, "5CCO": 2197, "5Cl)c": 2198, "5F)c": 2199, "5O4)": 2200, "5Oc5": 2201, "5[nH]4)": 2202, "5[nH]c(": 2203, "5c(C": 2204, "5c(c": 2205, "5c4)": 2206, "5c4C": 2207, "5c4c": 2208, "5c4n": 2209, "5c4o": 2210, "5cc(": 2211, "5ccc": 2212, "5ccn": 2213, "5cnn": 2214, "5n(C": 2215, "5n34": 2216, "5n4C": 2217, "5nc4": 2218, "5ncn": 2219, "5o4)": 2220, "5oc5": 2221, "5s4)": 2222, "5scc": 2223, "6)c5": 2224, "6)n4": 2225, "6)nc": 2226, "6)nn": 2227, "6=O)": 2228, "6CCN": 2229, "6c(=": 2230, "6c(c": 2231, "6c5o": 2232, "6ccc": 2233, "=C(/": 2234, "=C(Br": 2235, "=C(C": 2236, "=C(Cl": 2237, "=C(F": 2238, "=C(N": 2239, "=C(O": 2240, "=C(S": 2241, "=C([O-]": 2242, "=C(\\": 2243, "=C(c": 2244, "=C(n": 2245, "=C)C": 2246, "=C)c": 2247, "=C/4": 2248, "=C/C": 2249, "=C/N": 2250, "=C/O": 2251, "=C/S": 2252, "=C/c": 2253, "=C1)": 2254, "=C1/": 2255, "=C12": 2256, "=C1C": 2257, "=C1N": 2258, "=C1O": 2259, "=C1\\": 2260, "=C1c": 2261, "=C2)": 2262, "=C2/": 2263, "=C2C": 2264, "=C2N": 2265, "=C2O": 2266, "=C2\\": 2267, "=C2c": 2268, "=C3)": 2269, "=C3/": 2270, "=C3C": 2271, "=C3N": 2272, "=C3\\": 2273, "=C3c": 2274, "=CC(": 2275, "=CC1": 2276, "=CC2": 2277, "=CC3": 2278, "=CC=": 2279, "=CCC": 2280, "=CCO": 2281, "=CC[C@@H]": 2282, "=CC[C@H]": 2283, "=CCc": 2284, "=CCn": 2285, "=CN(": 2286, "=CN1": 2287, "=CN3": 2288, "=CNC": 2289, "=CO2": 2290, "=COC": 2291, "=C[C@@H](": 2292, "=C[C@H](": 2293, "=C[C@]3": 2294, "=C\\1": 2295, "=C\\C": 2296, "=C\\N": 2297, "=C\\c": 2298, "=C\\n": 2299, "=Cc1": 2300, "=Cc2": 2301, "=Cc3": 2302, "=Cc4": 2303, "=Cn2": 2304, "=N)C": 2305, "=N)N": 2306, "=N)c": 2307, "=N)n": 2308, "=N)s": 2309, "=N/C": 2310, "=N/N": 2311, "=N/O": 2312, "=N/S": 2313, "=N/c": 2314, "=N/n": 2315, "=N1)": 2316, "=N3)": 2317, "=NC(": 2318, "=NC1": 2319, "=NC2": 2320, "=NC3": 2321, "=NCC": 2322, "=NN(": 2323, "=NN/": 2324, "=NN1": 2325, "=NN2": 2326, "=NN3": 2327, "=NNC": 2328, "=NNc": 2329, "=NO1": 2330, "=NO2": 2331, "=NOC": 2332, "=NS(": 2333, "=N\\C": 2334, "=N\\N": 2335, "=N\\S": 2336, "=N\\c": 2337, "=Nc1": 2338, "=Nc2": 2339, "=Nc3": 2340, "=Nc5": 2341, "=Nn2": 2342, "=O)(": 2343, "=O)/": 2344, "=O)=": 2345, "=O)C": 2346, "=O)N": 2347, "=O)O": 2348, "=O)S": 2349, "=O)[C@@H]": 2350, "=O)[C@@]": 2351, "=O)[C@H]": 2352, "=O)[O-]": 2353, "=O)[nH]": 2354, "=O)c": 2355, "=O)n": 2356, "=O)o": 2357, "=O)s": 2358, "=S(=": 2359, "=S(C": 2360, "=S)[C@H]": 2361, "=S)[nH]": 2362, "=S1(": 2363, "=S1C": 2364, "=[N+]([O-]": 2365, "=c1/": 2366, "=c1[nH]": 2367, "=c1\\": 2368, "=c1c": 2369, "=c1n": 2370, "=c1o": 2371, "=c1s": 2372, "=c2/": 2373, "=c2\\": 2374, "=c2c": 2375, "=c4/": 2376, "=c4c": 2377, "Br)=C": 2378, "Br)C(": 2379, "Br)CC": 2380, "Br)NC": 2381, "Br)[nH]c": 2382, "Br)c(": 2383, "Br)c1": 2384, "Br)c2": 2385, "Br)c3": 2386, "Br)c5": 2387, "Br)c[nH]": 2388, "Br)cc": 2389, "Br)cn": 2390, "Br)cs": 2391, "Br)n(": 2392, "Br)n1": 2393, "Br)n2": 2394, "Br)nc": 2395, "Br)nn": 2396, "Br)o2": 2397, "Br)o3": 2398, "Br)o4": 2399, "Br)s1": 2400, "Br)s2": 2401, "Br)s3": 2402, "Brc1c": 2403, "C#Cc": 2404, "C#N)": 2405, "C(/C": 2406, "C(/F": 2407, "C(/c": 2408, "C(=C": 2409, "C(=N": 2410, "C(=O": 2411, "C(=c": 2412, "C(Br)": 2413, "C(C#": 2414, "C(C(": 2415, "C(C)": 2416, "C(C1": 2417, "C(C2": 2418, "C(C3": 2419, "C(C4": 2420, "C(C5": 2421, "C(C=": 2422, "C(CC": 2423, "C(CF": 2424, "C(CN": 2425, "C(CO": 2426, "C(CS": 2427, "C(C[C@H]": 2428, "C(Cc": 2429, "C(Cl)": 2430, "C(Cn": 2431, "C(F)": 2432, "C(N(": 2433, "C(N)": 2434, "C(N1": 2435, "C(N2": 2436, "C(N3": 2437, "C(N4": 2438, "C(N5": 2439, "C(NC": 2440, "C(NN": 2441, "C(NO": 2442, "C(NS": 2443, "C(N[C@H]": 2444, "C(Nc": 2445, "C(Nn": 2446, "C(O)": 2447, "C(O3": 2448, "C(OC": 2449, "C(O[C@@H]": 2450, "C(Oc": 2451, "C(S(": 2452, "C(SC": 2453, "C(Sc": 2454, "C([O-])": 2455, "C(\\C": 2456, "C(\\F": 2457, "C(\\N": 2458, "C(\\O": 2459, "C(\\c": 2460, "C(c1": 2461, "C(c2": 2462, "C(c3": 2463, "C(c4": 2464, "C(c5": 2465, "C(n1": 2466, "C(n2": 2467, "C(n3": 2468, "C(n4": 2469, "C)(=": 2470, "C)(C": 2471, "C)(N": 2472, "C)(O": 2473, "C)([C@@]": 2474, "C)(c": 2475, "C)-c": 2476, "C)-n": 2477, "C)/C": 2478, "C)/N": 2479, "C)=C": 2480, "C)=N": 2481, "C)=O": 2482, "C)C(": 2483, "C)C)": 2484, "C)C1": 2485, "C)C2": 2486, "C)C3": 2487, "C)C4": 2488, "C)C5": 2489, "C)C6": 2490, "C)C=": 2491, "C)CC": 2492, "C)CN": 2493, "C)CO": 2494, "C)CS": 2495, "C)C[C@@H]": 2496, "C)C[C@@]": 2497, "C)C[C@H]": 2498, "C)C[C@]": 2499, "C)C[N+]": 2500, "C)Cc": 2501, "C)Cn": 2502, "C)N(": 2503, "C)N1": 2504, "C)N2": 2505, "C)N3": 2506, "C)N=": 2507, "C)NC": 2508, "C)NS": 2509, "C)Nc": 2510, "C)O)": 2511, "C)O1": 2512, "C)O2": 2513, "C)O3": 2514, "C)O4": 2515, "C)OC": 2516, "C)O[C@@H]": 2517, "C)O[C@@]": 2518, "C)O[C@H]": 2519, "C)Oc": 2520, "C)S(": 2521, "C)S4": 2522, "C)SC": 2523, "C)[C@@H](": 2524, "C)[C@@H]1": 2525, "C)[C@@H]3": 2526, "C)[C@@]3": 2527, "C)[C@H](": 2528, "C)[C@H]2": 2529, "C)[C@](": 2530, "C)[C@]1": 2531, "C)[C@]2": 2532, "C)[nH]/": 2533, "C)[nH]3": 2534, "C)[nH]c": 2535, "C)[nH]n": 2536, "C)c(": 2537, "C)c1": 2538, "C)c2": 2539, "C)c3": 2540, "C)c4": 2541, "C)c5": 2542, "C)c[nH]": 2543, "C)cc": 2544, "C)cn": 2545, "C)cs": 2546, "C)n(": 2547, "C)n1": 2548, "C)n2": 2549, "C)n3": 2550, "C)n4": 2551, "C)n[nH]": 2552, "C)nc": 2553, "C)nn": 2554, "C)no": 2555, "C)o1": 2556, "C)o2": 2557, "C)o3": 2558, "C)oc": 2559, "C)on": 2560, "C)s1": 2561, "C)s2": 2562, "C)s3": 2563, "C)s4": 2564, "C)sc": 2565, "C/4)": 2566, "C/C(": 2567, "C/C1": 2568, "C/C2": 2569, "C/C=": 2570, "C/CC": 2571, "C/CN": 2572, "C/CO": 2573, "C/Cc": 2574, "C/Cn": 2575, "C/N(": 2576, "C/N=": 2577, "C/OC": 2578, "C/S(": 2579, "C/c1": 2580, "C/c2": 2581, "C/c3": 2582, "C/c5": 2583, "C1(C": 2584, "C1(F": 2585, "C1(N": 2586, "C1(O": 2587, "C1(c": 2588, "C1)=": 2589, "C1)C": 2590, "C1)N": 2591, "C1)O": 2592, "C1)S": 2593, "C1)[C@@H]": 2594, "C1)c": 2595, "C1)n": 2596, "C1/N": 2597, "C12)": 2598, "C12C": 2599, "C12N": 2600, "C12O": 2601, "C1=C": 2602, "C1=N": 2603, "C1=O": 2604, "C1=S": 2605, "C1C(": 2606, "C1C)": 2607, "C1C1": 2608, "C1C2": 2609, "C1C=": 2610, "C1CC": 2611, "C1CN": 2612, "C1CO": 2613, "C1CS": 2614, "C1C[C@H]": 2615, "C1Cc": 2616, "C1Cn": 2617, "C1N(": 2618, "C1N1": 2619, "C1N=": 2620, "C1NC": 2621, "C1NN": 2622, "C1NS": 2623, "C1N[C@@H]": 2624, "C1Nc": 2625, "C1O)": 2626, "C1O5": 2627, "C1OC": 2628, "C1O[C@@H]": 2629, "C1Oc": 2630, "C1SC": 2631, "C1\\C": 2632, "C1\\N": 2633, "C1\\O": 2634, "C1\\S": 2635, "C1c1": 2636, "C1c2": 2637, "C1c3": 2638, "C1n1": 2639, "C2(C": 2640, "C2(N": 2641, "C2(O": 2642, "C2(c": 2643, "C2)=": 2644, "C2)C": 2645, "C2)N": 2646, "C2)O": 2647, "C2)S": 2648, "C2)[C@@H]": 2649, "C2)[C@@]": 2650, "C2)[C@H]": 2651, "C2)[nH]": 2652, "C2)c": 2653, "C2)n": 2654, "C2)o": 2655, "C2)s": 2656, "C2/C": 2657, "C21C": 2658, "C23)": 2659, "C23C": 2660, "C2=C": 2661, "C2=N": 2662, "C2=O": 2663, "C2C#": 2664, "C2C(": 2665, "C2C)": 2666, "C2C1": 2667, "C2C2": 2668, "C2C3": 2669, "C2C4": 2670, "C2C=": 2671, "C2CC": 2672, "C2CN": 2673, "C2CO": 2674, "C2CS": 2675, "C2Cc": 2676, "C2Cn": 2677, "C2N(": 2678, "C2N)": 2679, "C2N1": 2680, "C2N=": 2681, "C2NC": 2682, "C2NN": 2683, "C2Nc": 2684, "C2O)": 2685, "C2OC": 2686, "C2S/": 2687, "C2Sc": 2688, "C2\\C": 2689, "C2\\N": 2690, "C2\\O": 2691, "C2\\S": 2692, "C2c1": 2693, "C2c2": 2694, "C2c3": 2695, "C2n2": 2696, "C3(C": 2697, "C3(N": 2698, "C3(O": 2699, "C3(c": 2700, "C3)-": 2701, "C3)=": 2702, "C3)C": 2703, "C3)N": 2704, "C3)O": 2705, "C3)[C@@H]": 2706, "C3)[nH]": 2707, "C3)c": 2708, "C3)n": 2709, "C3)o": 2710, "C3)s": 2711, "C3/C": 2712, "C312": 2713, "C31C": 2714, "C32)": 2715, "C34C": 2716, "C3=C": 2717, "C3=N": 2718, "C3=O": 2719, "C3C(": 2720, "C3C)": 2721, "C3C2": 2722, "C3C4": 2723, "C3C=": 2724, "C3CC": 2725, "C3CO": 2726, "C3CS": 2727, "C3Cc": 2728, "C3N)": 2729, "C3NC": 2730, "C3O)": 2731, "C3OC": 2732, "C3\\C": 2733, "C3c2": 2734, "C3c3": 2735, "C3c4": 2736, "C4(C": 2737, "C4)-": 2738, "C4)C": 2739, "C4)O": 2740, "C4)[nH]": 2741, "C4)c": 2742, "C4)n": 2743, "C4)o": 2744, "C4=N": 2745, "C4=O": 2746, "C4C3": 2747, "C4C5": 2748, "C4C=": 2749, "C4CC": 2750, "C4CN": 2751, "C4CO": 2752, "C4C[C@@H]": 2753, "C4OC": 2754, "C4c2": 2755, "C4c4": 2756, "C4c5": 2757, "C5(C": 2758, "C5)C": 2759, "C5)c": 2760, "C5)n": 2761, "C5)o": 2762, "C5=O": 2763, "C5CC": 2764, "C6)c": 2765, "C6=O": 2766, "C6CC": 2767, "C=C(": 2768, "C=C)": 2769, "C=C/": 2770, "C=C1": 2771, "C=C2": 2772, "C=C3": 2773, "C=CC": 2774, "C=CN": 2775, "C=CO": 2776, "C=C[C@@H]": 2777, "C=C[C@]": 2778, "C=C\\": 2779, "C=Cc": 2780, "C=N/": 2781, "C=NC": 2782, "C=NN": 2783, "C=NS": 2784, "C=Nc": 2785, "C=Nn": 2786, "C=O)": 2787, "C=c4": 2788, "CC#N": 2789, "CC(/": 2790, "CC(=": 2791, "CC(C": 2792, "CC(N": 2793, "CC(O": 2794, "CC(S": 2795, "CC(c": 2796, "CC(n": 2797, "CC)(": 2798, "CC)-": 2799, "CC)/": 2800, "CC)C": 2801, "CC)N": 2802, "CC)O": 2803, "CC)S": 2804, "CC)[C@@]": 2805, "CC)[C@]": 2806, "CC)c": 2807, "CC)n": 2808, "CC)s": 2809, "CC/C": 2810, "CC/N": 2811, "CC1(": 2812, "CC1)": 2813, "CC12": 2814, "CC1=": 2815, "CC1C": 2816, "CC1N": 2817, "CC1O": 2818, "CC1c": 2819, "CC1n": 2820, "CC2(": 2821, "CC2)": 2822, "CC21": 2823, "CC23": 2824, "CC2=": 2825, "CC2C": 2826, "CC2N": 2827, "CC2O": 2828, "CC2S": 2829, "CC2c": 2830, "CC2n": 2831, "CC3(": 2832, "CC3)": 2833, "CC32": 2834, "CC3=": 2835, "CC3C": 2836, "CC3O": 2837, "CC3c": 2838, "CC4(": 2839, "CC4)": 2840, "CC4C": 2841, "CC4O": 2842, "CC4c": 2843, "CC5(": 2844, "CC5)": 2845, "CC5C": 2846, "CC6)": 2847, "CC=C": 2848, "CC=N": 2849, "CCC#": 2850, "CCC(": 2851, "CCC)": 2852, "CCC/": 2853, "CCC1": 2854, "CCC2": 2855, "CCC3": 2856, "CCC4": 2857, "CCC5": 2858, "CCC=": 2859, "CCCC": 2860, "CCCF": 2861, "CCCN": 2862, "CCCO": 2863, "CCCS": 2864, "CCC[C@@H]": 2865, "CCC[C@H]": 2866, "CCC[C@]": 2867, "CCCc": 2868, "CCCn": 2869, "CCF)": 2870, "CCN(": 2871, "CCN)": 2872, "CCN1": 2873, "CCN2": 2874, "CCN3": 2875, "CCN4": 2876, "CCN5": 2877, "CCN=": 2878, "CCNC": 2879, "CCNS": 2880, "CCN[C@H]": 2881, "CCN[C@]": 2882, "CCN\\": 2883, "CCNc": 2884, "CCO)": 2885, "CCO/": 2886, "CCO1": 2887, "CCO2": 2888, "CCO3": 2889, "CCO4": 2890, "CCO5": 2891, "CCOC": 2892, "CCO[C@@H]": 2893, "CCO[C@H]": 2894, "CCOc": 2895, "CCS(": 2896, "CCS1": 2897, "CCS2": 2898, "CCS3": 2899, "CCSc": 2900, "CC[C@@H](": 2901, "CC[C@@H]1": 2902, "CC[C@@H]2": 2903, "CC[C@@H]3": 2904, "CC[C@@]1": 2905, "CC[C@@]2": 2906, "CC[C@H](": 2907, "CC[C@H]1": 2908, "CC[C@H]2": 2909, "CC[C@H]4": 2910, "CC[C@]1": 2911, "CC[C@]2": 2912, "CC[C@]3": 2913, "CC[N@@+]1": 2914, "CCc1": 2915, "CCc2": 2916, "CCc3": 2917, "CCc4": 2918, "CCc5": 2919, "CCn1": 2920, "CCn2": 2921, "CCn3": 2922, "CCn5": 2923, "CF)c": 2924, "CF)n": 2925, "CN(/": 2926, "CN(C": 2927, "CN(S": 2928, "CN(c": 2929, "CN(n": 2930, "CN)C": 2931, "CN)n": 2932, "CN)o": 2933, "CN/C": 2934, "CN1)": 2935, "CN12": 2936, "CN1C": 2937, "CN1N": 2938, "CN1O": 2939, "CN1S": 2940, "CN1c": 2941, "CN2)": 2942, "CN21": 2943, "CN23": 2944, "CN2C": 2945, "CN2N": 2946, "CN2O": 2947, "CN2S": 2948, "CN2c": 2949, "CN3)": 2950, "CN3C": 2951, "CN3S": 2952, "CN4)": 2953, "CN4C": 2954, "CN5C": 2955, "CN=C": 2956, "CNC(": 2957, "CNC1": 2958, "CNC2": 2959, "CNC3": 2960, "CNCC": 2961, "CNC[C@@H]": 2962, "CNC[C@H]": 2963, "CNCc": 2964, "CNNC": 2965, "CNS(": 2966, "CN[C@H](": 2967, "CN[C@H]1": 2968, "CN[C@H]2": 2969, "CN[C@]1": 2970, "CN\\C": 2971, "CNc1": 2972, "CNc2": 2973, "CNc3": 2974, "CNc4": 2975, "CNn3": 2976, "CO)C": 2977, "CO)N": 2978, "CO)O": 2979, "CO)S": 2980, "CO)[C@@]": 2981, "CO)[C@]": 2982, "CO)c": 2983, "CO)n": 2984, "CO/C": 2985, "CO/N": 2986, "CO1)": 2987, "CO2)": 2988, "CO3)": 2989, "CO4)": 2990, "CO5)": 2991, "COC(": 2992, "COC)": 2993, "COC1": 2994, "COC2": 2995, "COC3": 2996, "COC4": 2997, "COCC": 2998, "COCS": 2999, "COC[C@@H]": 3000, "COC[C@H]": 3001, "COC[C@]": 3002, "COCc": 3003, "CON(": 3004, "CON=": 3005, "CO[C@@H]1": 3006, "CO[C@H](": 3007, "CO[C@H]1": 3008, "CO[C@H]2": 3009, "COc1": 3010, "COc2": 3011, "COc3": 3012, "COc4": 3013, "COc5": 3014, "COn1": 3015, "CS(=": 3016, "CS(C": 3017, "CS(N": 3018, "CS/C": 3019, "CS1(": 3020, "CS2(": 3021, "CS2)": 3022, "CS3)": 3023, "CSC1": 3024, "CSC2": 3025, "CSC3": 3026, "CSC[C@@H]": 3027, "CSc1": 3028, "CSc2": 3029, "CSc3": 3030, "C[C@@H](C": 3031, "C[C@@H](F": 3032, "C[C@@H](N": 3033, "C[C@@H](O": 3034, "C[C@@H](c": 3035, "C[C@@H]12": 3036, "C[C@@H]1C": 3037, "C[C@@H]1N": 3038, "C[C@@H]1O": 3039, "C[C@@H]1S": 3040, "C[C@@H]1[C@@H]": 3041, "C[C@@H]1[C@H]": 3042, "C[C@@H]21": 3043, "C[C@@H]2C": 3044, "C[C@@H]2N": 3045, "C[C@@H]2O": 3046, "C[C@@H]2S": 3047, "C[C@@H]3C": 3048, "C[C@@H]3N": 3049, "C[C@@](C": 3050, "C[C@@]1(": 3051, "C[C@@]2(": 3052, "C[C@@]21": 3053, "C[C@H](C": 3054, "C[C@H](F": 3055, "C[C@H](N": 3056, "C[C@H](O": 3057, "C[C@H](c": 3058, "C[C@H](n": 3059, "C[C@H]12": 3060, "C[C@H]1C": 3061, "C[C@H]1N": 3062, "C[C@H]1O": 3063, "C[C@H]1c": 3064, "C[C@H]21": 3065, "C[C@H]2C": 3066, "C[C@H]2N": 3067, "C[C@H]2O": 3068, "C[C@H]2[C@H]": 3069, "C[C@H]2c": 3070, "C[C@H]3C": 3071, "C[C@H]3O": 3072, "C[C@H]4C": 3073, "C[C@]1(": 3074, "C[C@]12": 3075, "C[C@]13": 3076, "C[C@]2(": 3077, "C[C@]23": 3078, "C[C@]3(": 3079, "C[C@]31": 3080, "C[C@]4(": 3081, "C[N+](=": 3082, "C[N@@+]1(": 3083, "C\\1C": 3084, "C\\C(": 3085, "C\\C2": 3086, "C\\C=": 3087, "C\\Cc": 3088, "C\\NN": 3089, "C\\c1": 3090, "C\\c2": 3091, "C\\c3": 3092, "C\\n1": 3093, "Cc1[nH]": 3094, "Cc1c": 3095, "Cc1n": 3096, "Cc1o": 3097, "Cc1s": 3098, "Cc2[nH]": 3099, "Cc2c": 3100, "Cc2n": 3101, "Cc2o": 3102, "Cc2s": 3103, "Cc3[nH]": 3104, "Cc3c": 3105, "Cc3n": 3106, "Cc3s": 3107, "Cc4c": 3108, "Cc4n": 3109, "Cc4o": 3110, "Cc4s": 3111, "Cc5c": 3112, "Cl)=C": 3113, "Cl)C(": 3114, "Cl)C1": 3115, "Cl)C2": 3116, "Cl)CC": 3117, "Cl)N(": 3118, "Cl)N1": 3119, "Cl)NC": 3120, "Cl)Nc": 3121, "Cl)O1": 3122, "Cl)OC": 3123, "Cl)Oc": 3124, "Cl)S(": 3125, "Cl)[C@H](": 3126, "Cl)[C@H]1": 3127, "Cl)[nH]1": 3128, "Cl)[nH]c": 3129, "Cl)c(": 3130, "Cl)c1": 3131, "Cl)c2": 3132, "Cl)c3": 3133, "Cl)c4": 3134, "Cl)c5": 3135, "Cl)c[nH]": 3136, "Cl)cc": 3137, "Cl)cn": 3138, "Cl)cs": 3139, "Cl)n(": 3140, "Cl)n1": 3141, "Cl)n2": 3142, "Cl)n3": 3143, "Cl)n[nH]": 3144, "Cl)nc": 3145, "Cl)nn": 3146, "Cl)no": 3147, "Cl)o1": 3148, "Cl)o2": 3149, "Cl)s1": 3150, "Cl)s2": 3151, "Cl)s3": 3152, "Cl)sc": 3153, "Cl/C(": 3154, "Clc1c": 3155, "Clc1n": 3156, "Cn1[nH]": 3157, "Cn1c": 3158, "Cn1n": 3159, "Cn2[nH]": 3160, "Cn2c": 3161, "Cn2n": 3162, "Cn3c": 3163, "Cn3n": 3164, "Cn4c": 3165, "Cn5c": 3166, "F)(F": 3167, "F)=C": 3168, "F)C(": 3169, "F)C1": 3170, "F)C2": 3171, "F)CC": 3172, "F)CN": 3173, "F)C[C@@]": 3174, "F)C[C@H]": 3175, "F)Cc": 3176, "F)F)": 3177, "F)N(": 3178, "F)N1": 3179, "F)NC": 3180, "F)Nc": 3181, "F)OC": 3182, "F)Oc": 3183, "F)S3": 3184, "F)[C@@H]3": 3185, "F)[C@@]3": 3186, "F)[nH]n": 3187, "F)c(": 3188, "F)c1": 3189, "F)c2": 3190, "F)c3": 3191, "F)c4": 3192, "F)cc": 3193, "F)cn": 3194, "F)cs": 3195, "F)n1": 3196, "F)n2": 3197, "F)n3": 3198, "F)n[nH]": 3199, "F)nc": 3200, "F)nn": 3201, "F)no": 3202, "F)o2": 3203, "F)oc": 3204, "Fc1c": 3205, "I)c(": 3206, "I)c1": 3207, "I)cc": 3208, "I)co": 3209, "Ic1c": 3210, "N#Cc": 3211, "N(/C": 3212, "N(/N": 3213, "N(C#": 3214, "N(C(": 3215, "N(C)": 3216, "N(C/": 3217, "N(C1": 3218, "N(C2": 3219, "N(C3": 3220, "N(C4": 3221, "N(C5": 3222, "N(C=": 3223, "N(CC": 3224, "N(C[C@@H]": 3225, "N(Cc": 3226, "N(S(": 3227, "N(c1": 3228, "N(c2": 3229, "N(c3": 3230, "N(c4": 3231, "N(c5": 3232, "N(n1": 3233, "N)(=": 3234, "N)(c": 3235, "N)=C": 3236, "N)=N": 3237, "N)=O": 3238, "N)C(": 3239, "N)C1": 3240, "N)C2": 3241, "N)C3": 3242, "N)CC": 3243, "N)CN": 3244, "N)C[C@H]": 3245, "N)Cc": 3246, "N)N(": 3247, "N)N)": 3248, "N)NC": 3249, "N)Nc": 3250, "N)OC": 3251, "N)[nH]2": 3252, "N)[nH]3": 3253, "N)[nH]c": 3254, "N)c(": 3255, "N)c1": 3256, "N)c2": 3257, "N)c3": 3258, "N)c4": 3259, "N)cc": 3260, "N)cn": 3261, "N)cs": 3262, "N)n(": 3263, "N)n1": 3264, "N)n2": 3265, "N)n[nH]": 3266, "N)nc": 3267, "N)nn": 3268, "N)no": 3269, "N)o2": 3270, "N)on": 3271, "N)sc": 3272, "N/C#": 3273, "N/C(": 3274, "N/Cc": 3275, "N/N(": 3276, "N/N=": 3277, "N/Nc": 3278, "N/O)": 3279, "N/S(": 3280, "N/c1": 3281, "N/c2": 3282, "N/c3": 3283, "N/c4": 3284, "N/n1": 3285, "N/n2": 3286, "N/n3": 3287, "N1)C": 3288, "N1)N": 3289, "N1/C": 3290, "N1C(": 3291, "N1C1": 3292, "N1C2": 3293, "N1C=": 3294, "N1CC": 3295, "N1C[C@@H]": 3296, "N1C[C@H]": 3297, "N1Cc": 3298, "N1N=": 3299, "N1Nc": 3300, "N1O/": 3301, "N1OC": 3302, "N1O[C@H]": 3303, "N1S(": 3304, "N1c1": 3305, "N1c2": 3306, "N1c3": 3307, "N2)C": 3308, "N2)c": 3309, "N2)n": 3310, "N2)s": 3311, "N23)": 3312, "N2C(": 3313, "N2C)": 3314, "N2C1": 3315, "N2C2": 3316, "N2C=": 3317, "N2CC": 3318, "N2C[C@@H]": 3319, "N2C[C@H]": 3320, "N2Cc": 3321, "N2N=": 3322, "N2O)": 3323, "N2OC": 3324, "N2S(": 3325, "N2c1": 3326, "N2c2": 3327, "N2c3": 3328, "N3)C": 3329, "N3)N": 3330, "N3)c": 3331, "N3)n": 3332, "N32)": 3333, "N3C(": 3334, "N3C)": 3335, "N3C1": 3336, "N3CC": 3337, "N3CS": 3338, "N3C[C@@H]": 3339, "N3C[C@H]": 3340, "N3Cc": 3341, "N3S(": 3342, "N4)n": 3343, "N4CC": 3344, "N4CO": 3345, "N4C[C@@H]": 3346, "N5CC": 3347, "N=C(": 3348, "N=C/": 3349, "N=C1": 3350, "N=C2": 3351, "N=C3": 3352, "N=CC": 3353, "N=CN": 3354, "N=C\\": 3355, "N=c1": 3356, "N=c2": 3357, "N=c4": 3358, "NC(=": 3359, "NC(C": 3360, "NC(N": 3361, "NC(c": 3362, "NC)C": 3363, "NC)c": 3364, "NC1(": 3365, "NC1)": 3366, "NC12": 3367, "NC1=": 3368, "NC1C": 3369, "NC2)": 3370, "NC2=": 3371, "NC2C": 3372, "NC2c": 3373, "NC3(": 3374, "NC3)": 3375, "NC3=": 3376, "NC3C": 3377, "NC4(": 3378, "NC4)": 3379, "NC4=": 3380, "NC4C": 3381, "NCC(": 3382, "NCC1": 3383, "NCC2": 3384, "NCC3": 3385, "NCC4": 3386, "NCC5": 3387, "NCCC": 3388, "NCCN": 3389, "NCCO": 3390, "NCCS": 3391, "NCCc": 3392, "NCCn": 3393, "NC[C@@H]1": 3394, "NC[C@H](": 3395, "NC[C@H]2": 3396, "NCc1": 3397, "NCc2": 3398, "NCc3": 3399, "NCc4": 3400, "NN(C": 3401, "NN(c": 3402, "NN/C": 3403, "NN12": 3404, "NN1C": 3405, "NN1c": 3406, "NN2)": 3407, "NN23": 3408, "NN2C": 3409, "NN3C": 3410, "NN=C": 3411, "NNC(": 3412, "NNS(": 3413, "NNc1": 3414, "NNc2": 3415, "NO2)": 3416, "NOC(": 3417, "NOC3": 3418, "NOCC": 3419, "NOCc": 3420, "NS(=": 3421, "NS(C": 3422, "N[C@@H](C": 3423, "N[C@@H]1C": 3424, "N[C@@H]1[C@@H]": 3425, "N[C@@H]2C": 3426, "N[C@@H]2c": 3427, "N[C@H](C": 3428, "N[C@H](c": 3429, "N[C@H]1C": 3430, "N[C@H]2C": 3431, "N[C@H]3C": 3432, "N[C@]1(": 3433, "N\\C(": 3434, "N\\C1": 3435, "N\\C=": 3436, "N\\CC": 3437, "N\\Cc": 3438, "N\\N=": 3439, "N\\S(": 3440, "N\\c1": 3441, "N\\c3": 3442, "Nc1[nH]": 3443, "Nc1c": 3444, "Nc1n": 3445, "Nc1o": 3446, "Nc1s": 3447, "Nc2[nH]": 3448, "Nc2c": 3449, "Nc2n": 3450, "Nc2o": 3451, "Nc2s": 3452, "Nc3c": 3453, "Nc3n": 3454, "Nc3o": 3455, "Nc4c": 3456, "Nc4n": 3457, "Nc5c": 3458, "Nn1c": 3459, "Nn2c": 3460, "Nn3c": 3461, "Nn3n": 3462, "O)(/": 3463, "O)(=": 3464, "O)(C": 3465, "O)(N": 3466, "O)([O-]": 3467, "O)(c": 3468, "O)/C": 3469, "O)/N": 3470, "O)=C": 3471, "O)=N": 3472, "O)=O": 3473, 