{"#N)": 0, "(": 1, "(-": 2, "(-c2ccccc2)": 3, "(-c3ccccc3)": 4, "(=O)": 5, "(=O)=O": 6, "(=O)=O)": 7, "(=O)=O)cc1": 8, "(=O)o": 9, "(C": 10, "(C(=O)O)": 11, "(C(F)(F)F)": 12, "(C)": 13, "(C)(": 14, "(C)(C)": 15, "(C)C": 16, "(C)C)": 17, "(C)C)cc1": 18, "(C)CC": 19, "(C)c1": 20, "(CC": 21, "(CC)": 22, "(CO)": 23, "(Cl)": 24, "(F)": 25, "(N": 26, "(N)": 27, "(N3": 28, "(O": 29, "(O)": 30, "(O)(": 31, "([O-])": 32, "(c1ccccc1)": 33, "(c2ccccc2)": 34, ")": 35, ")cc": 36, ")cc(": 37, ")cc(-": 38, ")cc(C)": 39, ")cc(O)": 40, ")cc(OC)c1OC": 41, ")cc1": 42, ")cc1)": 43, ")cc12": 44, ")cc2": 45, ")cc2)": 46, ")cc2)cc1": 47, ")cc3": 48, ")cc3)": 49, ")ccc1": 50, ")ccc1O": 51, ")ccc2": 52, ")ccc3": 53, ")ccn1": 54, "-": 55, "-2": 56, "-c1c(": 57, "-c1cc": 58, "-c1cc(": 59, "-c1ccc(": 60, "-c1ccccc1": 61, "-c1n": 62, "-c2": 63, "-c2[nH]": 64, "-c2c3c(": 65, "-c2c[nH]": 66, "-c2cc": 67, "-c2cc(": 68, "-c2ccc(": 69, "-c2ccc(-": 70, "-c2ccc(F)cc2)": 71, "-c2ccccc2": 72, "-c2ccccc2)": 73, "-c2cn": 74, "-c2cs": 75, "-c2n": 76, "-c2nc(": 77, "-c2nc(-": 78, "-c2nc(N": 79, "-c2o": 80, "-c2s": 81, "-n1": 82, "-n2": 83, "/": 84, "/C": 85, "/C(": 86, "/C(=C(/": 87, "/C(=C(\\": 88, "/C(=C/": 89, "/C(=C\\": 90, "/C(=N/": 91, "/C(=N\\": 92, "/C(C#N)": 93, "/C(C)=C/": 94, "/C1=C\\": 95, "/C=C(/": 96, "/C=C(\\": 97, "/C=C(\\C)": 98, "/C=C/": 99, "/C=C/C": 100, "/C=C/C=C/": 101, "/C=C1\\": 102, "/C=C2\\": 103, "/C=C3": 104, "/C=C\\": 105, "/C=N/": 106, "/C=N/N": 107, "/N": 108, "/N=": 109, "/N=C(\\": 110, "/N=C/": 111, "/N=C1\\": 112, "/N=C2": 113, "/N=C2\\": 114, "/N=C\\": 115, "/c(": 116, "1": 117, "1)": 118, "1C": 119, "2": 120, "2)": 121, "2)C1": 122, "2)CC1": 123, "2)c1": 124, "2)cc(": 125, "2)cc1": 126, "2)cc1)": 127, "2)ccc1": 128, "3": 129, "3)": 130, "3)CC1": 131, "3)c1": 132, "3)cc": 133, "3)cc(": 134, "3)cc1": 135, "3)cc1)": 136, "3)cc2": 137, "3)cc2)": 138, "3)cc2)CC1": 139, "3)cc2)c1": 140, "3)cc2)cc1": 141, "3)cc21": 142, "3)ccc1": 143, "3)ccc2": 144, "3)ccc21": 145, "3C)": 146, "4": 147, "4)": 148, "4)CC3)": 149, "4)c3)": 150, "4)cc": 151, "4)cc2": 152, "4)cc2)": 153, "4)cc3": 154, "4)cc3)": 155, "4CCCC": 156, "4CCCC4)": 157, "4CCCCC4)": 158, "4CCOCC4)": 159, "5": 160, "5)": 161, "5)cc": 162, "5)cc4)": 163, "5CCCC": 164, "5CCOCC": 165, "6": 166, "6)": 167, "=": 168, "=C": 169, "=C(": 170, "=C(C#N)": 171, "=C(C)": 172, "=C(N)N)": 173, "=C(O)": 174, "=C(\\": 175, "=C/": 176, "=C1": 177, "=C1\\": 178, "=C2": 179, "=C3": 180, "=CC(=O)": 181, "=C\\": 182, "=N": 183, "=N)": 184, "=N/": 185, "=N1": 186, "=N2": 187, "=N\\": 188, "=O": 189, "=O)": 190, "=O)C1": 191, "=O)CC1": 192, "=O)[nH]": 193, "=O)c1": 194, "=O)cc(": 195, "=O)cc1": 196, "=O)cc1)": 197, "=O)n(": 198, "=O)o": 199, "=S)": 200, "Br": 201, "Br)": 202, "Br)c1": 203, "Br)c1)": 204, "Br)c2)": 205, "Br)c3)": 206, "Br)cc": 207, "Br)cc(": 208, "Br)cc1": 209, "Br)cc1)": 210, "Br)cc2": 211, "Br)cc2)": 212, "Br)ccc1": 213, "C": 214, "C#": 215, "C#C": 216, "C#N": 217, "C#N)": 218, "C#N)c1": 219, "C#N)cc": 220, "C#N)cc(": 221, "C#N)cc1": 222, "C#N)cc2": 223, "C#N)cc2)": 224, "C(": 225, "C(=": 226, "C(=C)": 227, "C(=C/": 228, "C(=N": 229, "C(=N)": 230, "C(=O)": 231, "C(=O)C": 232, "C(=O)C(": 233, "C(=O)C(C)": 234, "C(=O)C1": 235, "C(=O)C2": 236, "C(=O)CC": 237, "C(=O)CS": 238, "C(=O)N": 239, "C(=O)N(": 240, "C(=O)N(C": 241, "C(=O)N(C)": 242, "C(=O)N(C)C": 243, "C(=O)N(C)C)": 244, "C(=O)N(CC)": 245, "C(=O)N1": 246, "C(=O)N1CC": 247, "C(=O)N1CCC(": 248, "C(=O)N1CCC[C@H]1": 249, "C(=O)N1CCN(": 250, "C(=O)N1CCN(C(=O)": 251, "C(=O)N2": 252, "C(=O)N2C": 253, "C(=O)N2CC": 254, "C(=O)N2CCC(": 255, "C(=O)N2CCN(": 256, "C(=O)N3": 257, "C(=O)NC": 258, "C(=O)NC(": 259, "C(=O)NC(=O)": 260, "C(=O)NC(=O)N": 261, "C(=O)NC2": 262, "C(=O)NCC": 263, "C(=O)N[C@@H](": 264, "C(=O)N[C@@H]1": 265, "C(=O)N[C@H]1": 266, "C(=O)Nc1ccc(": 267, "C(=O)Nc1ccccc1": 268, "C(=O)Nc2ccc(": 269, "C(=O)O": 270, "C(=O)O)": 271, "C(=O)O)c1": 272, "C(=O)O)cc1": 273, "C(=O)O)cc1)": 274, "C(=O)O)cc2)": 275, "C(=O)O1": 276, "C(=O)OC": 277, "C(=O)OC(C)(C)C)": 278, "C(=O)OC)": 279, "C(=O)OCC": 280, "C(=O)OCC(=O)": 281, "C(=O)OCC)": 282, "C(=O)c1c(": 283, "C(=O)c1ccccc1": 284, "C(=O)c2c(": 285, "C(=O)c2ccccc2": 286, "C(C": 287, "C(C#N)": 288, "C(C(": 289, "C(C(=O)": 290, "C(C(=O)N": 291, "C(C(=O)O)": 292, "C(C(C)C)": 293, "C(C)": 294, "C(C)(": 295, "C(C)(C)": 296, "C(C)(C)C": 297, "C(C)(C)C)": 298, "C(C)(C)C)cc1": 299, "C(C)(C)C)cc2)": 300, "C(C)(C)O": 301, "C(C)(C)O)": 302, "C(C)(O)": 303, "C(C)=O": 304, "C(C)=O)": 305, "C(C)=O)cc1": 306, "C(C)C": 307, "C(C)C)": 308, "C(C)C)c1": 309, "C(C)C)cc1": 310, "C(C)C)cc2)": 311, "C(CC": 312, "C(CC)": 313, "C(CN": 314, "C(CO": 315, "C(CO)": 316, "C(Cl)": 317, "C(F)": 318, "C(F)(F)": 319, "C(F)(F)F": 320, "C(F)(F)F)": 321, "C(F)(F)F)c1": 322, "C(F)(F)F)c1)": 323, "C(F)(F)F)cc": 324, "C(F)(F)F)cc(C(F)(F)F)": 325, "C(F)(F)F)cc1)": 326, "C(F)F)": 327, "C(N": 328, "C(N(": 329, "C(N)": 330, "C(N)=O": 331, "C(N)=O)": 332, "C(N2": 333, "C(N3": 334, "C(NC(=O)": 335, "C(O": 336, "C(O)": 337, "C(O)(": 338, "C(OC(=O)": 339, "C(c1ccc(": 340, "C(c1ccccc1)": 341, "C(c2ccccc2)": 342, "C(c3ccccc3)": 343, "C)": 344, "C)C": 345, "C)C(=O)": 346, "C)C1": 347, "C)CC1": 348, "C)c(": 349, "C)c1": 350, "C)cc1": 351, "C)cc1)": 352, "C)cc2": 353, "C)cc2)": 354, "C/C(=C\\": 355, "C/C=C/": 356, "C1": 357, "C1(": 358, "C1(C)": 359, "C1(C)C": 360, "C1(O)": 361, "C1(c2ccccc2)": 362, "C1)": 363, "C1)C2": 364, "C12": 365, "C12CC3": 366, "C12CC3CC(CC(C3)": 367, "C1=": 368, "C1=C": 369, "C1=C(": 370, "C1=C(C)": 371, "C1=C(O)": 372, "C1=N": 373, "C1=O": 374, "C1=O)": 375, "C1=S": 376, "C1C": 377, "C1C(": 378, "C1C2": 379, "C1CC": 380, "C1CC(": 381, "C1CC1": 382, "C1CC2": 383, "C1CCC(": 384, "C1CCCC": 385, "C1CCCC1": 386, "C1CCCC1)": 387, "C1CCCCC1": 388, "C1CCCCC1)": 389, "C1CCCN(": 390, "C1CCN(": 391, "C1CCN(C": 392, "C1CCN(C(=O)": 393, "C1CN(": 394, "C1N": 395, "C1O": 396, "C2": 397, "C2(": 398, "C2(C)": 399, "C2(C)C": 400, "C2(C)C)": 401, "C2)": 402, "C2)C1": 403, "C2)C3)": 404, "C2)CC1": 405, "C2)c1": 406, "C2)cc1": 407, "C2)ccc1": 408, "C2)n1": 409, "C21": 410, "C23": 411, "C23CC4CC(CC(C4)": 412, "C2=": 413, "C2=C(": 414, "C2=C(O)": 415, "C2=N": 416, "C2=O": 417, "C2=O)": 418, "C2=O)c1": 419, "C2=O)cc1": 420, "C2C3": 421, "C2CC": 422, "C2CC(": 423, "C2CC2)": 424, "C2CCC2)": 425, "C2CCCC": 426, "C2CCCC2)": 427, "C2CCCCC2)": 428, "C2CCN(": 429, "C2CCN(C": 430, "C2CCN(C(=O)": 431, "C3": 432, "C3(": 433, "C3)": 434, "C3)cc1": 435, "C3)cc2)": 436, "C34": 437, "C3=": 438, "C3=C(": 439, "C3=N": 440, "C3=O)": 441, "C3CC3)": 442, "C3CCC3)": 443, "C3CCCC3)": 444, "C3CCCCC3": 445, "C3CCCCC3)": 446, "C3CCN(": 447, "C4": 448, "C4)": 449, "C4)cc3)": 450, "C4=O)": 451, "C4CC4)": 452, "C4CCCC": 453, "C4CCCCC4)": 454, "C5": 455, "C5)": 456, "C=": 457, "C=C": 458, "C=C(": 459, "C=C(C)": 460, "C=C1": 461, "C=C2": 462, "C=C3": 463, "C=CC(": 464, "C=CC(=O)": 465, "C=N": 466, "CC": 467, "CC#N)": 468, "CC(": 469, "CC(=O)": 470, "CC(=O)N": 471, "CC(=O)N(": 472, "CC(=O)N1": 473, "CC(=O)N1CCN(": 474, "CC(=O)N2": 475, "CC(=O)N3": 476, "CC(=O)NC(": 477, "CC(=O)Nc1ccc(": 478, "CC(=O)O": 479, "CC(=O)O)": 480, "CC(=O)OC": 481, "CC(=O)OC)": 482, "CC(C(=O)N": 483, "CC(C)": 484, "CC(C)(": 485, "CC(C)(C)": 486, "CC(C)(C)C": 487, "CC(C)(C)C)": 488, "CC(C)(C)N": 489, "CC(C)(C)O": 490, "CC(C)(O)": 491, "CC(C)=": 492, "CC(C)C": 493, "CC(C)C)": 494, "CC(C)N": 495, "CC(C)O": 496, "CC(CC(": 497, "CC(CO)": 498, "CC(N": 499, "CC(N)": 500, "CC(NC(=O)": 501, "CC(O": 502, "CC(O)": 503, "CC(O)(": 504, "CC(O)CO": 505, "CC(c1ccccc1)": 506, "CC(c2ccccc2)": 507, "CC)": 508, "CC)c1": 509, "CC)cc1": 510, "CC1": 511, "CC1(": 512, "CC1(C)": 513, "CC1(C)C": 514, "CC1)": 515, "CC12": 516, "CC1=": 517, "CC1=C(": 518, "CC1=N": 519, "CC1=O": 520, "CC1CC1": 521, "CC1CCCCC1)": 522, "CC1CCCO": 523, "CC1CCN(": 524, "CC2": 525, "CC2(": 526, "CC2)": 527, "CC2)C1": 528, "CC2)CC1": 529, "CC2)c1": 530, "CC2)cc(": 531, "CC2)cc1": 532, "CC2)ccc1": 533, "CC2)n1": 534, "CC2=O": 535, "CC2=O)": 536, "CC2CCCCC2)": 537, "CC3": 538, "CC3(": 539, "CC3)": 540, "CC3)cc": 541, "CC3)cc1": 542, "CC3)cc2": 543, "CC4": 544, "CC4)": 545, "CC5": 546, "CC5)": 547, "CC=": 548, "CC=C)": 549, "CCC": 550, "CCC(": 551, "CCC(=O)": 552, "CCC(=O)N": 553, "CCC(=O)N1": 554, "CCC(=O)O": 555, "CCC(=O)O)": 556, "CCC(C(=O)N": 557, "CCC(C)": 558, "CCC(C)(C)": 559, "CCC(C)C)": 560, "CCC(CC)": 561, "CCC(N": 562, "CCC(N)": 563, "CCC(N3": 564, "CCC(O)": 565, "CCC)": 566, "CCC1": 567, "CCC1(": 568, "CCC1)": 569, "CCC12": 570, "CCC2": 571, "CCC2(": 572, "CCC2(CC1)": 573, "CCC2)": 574, "CCC3": 575, "CCC3(": 576, "CCC3(CC2)": 577, "CCC3)": 578, "CCC4": 579, "CCC4)": 580, "CCCC": 581, "CCCC(": 582, "CCCC(=O)": 583, "CCCC(=O)N": 584, "CCCC(=O)O)": 585, "CCCC(C)": 586, "CCCC(N": 587, "CCCC1": 588, "CCCC1)": 589, "CCCC2": 590, "CCCC2)": 591, "CCCC2)cc1": 592, "CCCC3": 593, "CCCC3)": 594, "CCCC4)": 595, "CCCCC": 596, "CCCCC1": 597, "CCCCC1)": 598, "CCCCC2": 599, "CCCCC2)": 600, "CCCCC2)cc1": 601, "CCCCC3": 602, "CCCCC3)": 603, "CCCCCC3)": 604, "CCCCCCN": 605, "CCCCN": 606, "CCCCN(": 607, "CCCCN1": 608, "CCCCO": 609, "CCCN": 610, "CCCN(": 611, "CCCN(C(=O)": 612, "CCCN(C)": 613, "CCCN(C)C)": 614, "CCCN(CCC)": 615, "CCCN1": 616, "CCCN1C(=O)": 617, "CCCN1CCN(": 618, "CCCN2": 619, "CCCN2C(=O)": 620, "CCCN3": 621, "CCCNC(=O)": 622, "CCCO": 623, "CCCO)": 624, "CCCO2)": 625, "CCCO3)": 626, "CCCS": 627, "CCC[C@@H](": 628, "CCC[C@@H]1": 629, "CCC[C@H](": 630, "CCC[C@H]1": 631, "CCC[C@H]2": 632, "CCCn1": 633, "CCN": 634, "CCN(": 635, "CCN(C": 636, "CCN(C(": 637, "CCN(C(=O)": 638, "CCN(C)": 639, "CCN(C)C": 640, "CCN(C)C)": 641, "CCN(C)CC": 642, "CCN(C)CC1": 643, "CCN(C)CC1)": 644, "CCN(C)CC2)": 645, "CCN(C)CC3)": 646, "CCN(CC)": 647, "CCN(CC)C(=O)": 648, "CCN(S(=O)(=O)": 649, "CCN)": 650, "CCN1": 651, "CCN1C": 652, "CCN1C(=O)": 653, "CCN1CCN(": 654, "CCN2": 655, "CCN2C(=O)": 656, "CCN2CCOCC2)": 657, "CCN3": 658, "CCN3CCOCC3)": 659, "CCNC(=O)": 660, "CCNCC1": 661, "CCNCC2)": 662, "CCNCC3)": 663, "CCNS(=O)(=O)": 664, "CCO": 665, "CCO)": 666, "CCO1": 667, "CCOC": 668, "CCOC(": 669, "CCOC(=O)": 670, "CCOC)": 671, "CCOC1": 672, "CCOCC": 673, "CCOCC1": 674, "CCOCC1)": 675, "CCOCC2)": 676, "CCOCC2)c1": 677, "CCOCC2)cc1": 678, "CCOCC3)": 679, "CCOCC3)cc2)": 680, "CCOCC4)": 681, "CCOc1cc(": 682, "CCOc1ccc(": 683, "CCOc1ccccc1": 684, "CCS": 685, "CCS(=O)(=O)": 686, "CC[C@@H](": 687, "CC[C@@H](C)": 688, "CC[C@@H](O)": 689, "CC[C@@H]2": 690, "CC[C@@H]3": 691, "CC[C@H](": 692, "CC[C@H](C)": 693, "CC[C@H](NC(=O)": 694, "CC[C@H]2": 695, "CC[C@H]4": 696, "CC[C@]3(C)": 697, "CCc1cc(": 698, "CCc1ccc(": 699, "CCc1ccccc1": 700, "CCc1ccccc1)": 701, "CCc1n": 702, "CCc2c(": 703, "CCc2ccccc2)": 704, "CCc3ccccc3)": 705, "CCn1": 706, "CCn1c(=O)": 707, "CCn1cc(": 708, "CCn2": 709, "CN": 710, "CN(": 711, "CN(C": 712, "CN(C(=O)": 713, "CN(C)": 714, "CN(C)C": 715, "CN(C)C(=O)": 716, "CN(C)C)": 717, "CN(C)S(=O)(=O)": 718, "CN(C)c1ccc(": 719, "CN(CC)": 720, "CN(Cc1ccccc1)": 721, "CN(S(=O)(=O)": 722, "CN)": 723, "CN1": 724, "CN1C(=O)": 725, "CN1CC": 726, "CN1CCC(": 727, "CN1CCN(": 728, "CN2": 729, "CN2C(=O)": 730, "CN2CC": 731, "CN2CCC(": 732, "CN2CCN(": 733, "CN3": 734, "CN3CCN(": 735, "CN4": 736, "CNC": 737, "CNC(": 738, "CNC(=O)": 739, "CNC(=O)N": 740, "CNCC": 741, "CNS(=O)(=O)": 742, "CO": 743, "CO)": 744, "CO1": 745, "CO2": 746, "COC": 747, "COC(": 748, "COC(=O)": 749, "COC(=O)N": 750, "COC(=O)c1ccc(": 751, "COC)": 752, "COCCO": 753, "CO[C@@H]1": 754, "CO[C@H]1": 755, "COc1c(": 756, "COc1cc": 757, "COc1cc(": 758, "COc1cc(N": 759, "COc1cc(OC)": 760, "COc1cc2": 761, "COc1cc2c(": 762, "COc1cc2c(cc1": 763, "COc1cc2c(cc1OC)": 764, "COc1ccc(": 765, "COc1ccc(-": 766, "COc1ccc(-c2n": 767, "COc1ccc(-n2": 768, "COc1ccc(C2": 769, "COc1ccc(Cl)cc1": 770, "COc1ccc(N": 771, "COc1ccc(NC(=O)": 772, "COc1ccc(OC)c(": 773, "COc1ccc2[nH]": 774, "COc1ccc2c(": 775, "COc1ccc2c(c1)": 776, "COc1cccc(": 777, "COc1cccc2": 778, "COc1ccccc1": 779, "COc1ccccc1N1CCN(": 780, "COc2ccc(": 781, "CS": 782, "CS(=O)(=O)": 783, "CS(=O)(=O)N": 784, "CSc1n": 785, "CSc2n": 786, "C[C@@H](": 787, "C[C@@H](C)": 788, "C[C@@H](N)": 789, "C[C@@H](NC(=O)": 790, "C[C@@H](O)": 791, "C[C@@H]1": 792, "C[C@@H]2": 793, "C[C@@H]3": 794, "C[C@H](": 795, "C[C@H](C)": 796, "C[C@H](N": 797, "C[C@H](N)": 798, "C[C@H](NC(=O)": 799, "C[C@H](O)": 800, "C[C@H]1": 801, "C[C@H]2": 802, "C[C@H]3": 803, "C[C@H]4": 804, "C[C@]12": 805, "Cc1": 806, "Cc1[nH]": 807, "Cc1c(": 808, "Cc1c(C)": 809, "Cc1c(Cl)": 810, "Cc1c[nH]": 811, "Cc1c[nH]c2ccccc12)": 812, "Cc1cc": 813, "Cc1cc(": 814, "Cc1cc(C)": 815, "Cc1cc(C)cc(": 816, "Cc1cc(N": 817, "Cc1cc2": 818, "Cc1ccc(": 819, "Cc1ccc(-": 820, "Cc1ccc(-c2ccccc2": 821, "Cc1ccc(-c2n": 822, "Cc1ccc(-n2": 823, "Cc1ccc(C(=O)N": 824, "Cc1ccc(C)": 825, "Cc1ccc(Cl)cc1": 826, "Cc1ccc(Cl)cc1)": 827, "Cc1ccc(F)cc1": 828, "Cc1ccc(F)cc1)": 829, "Cc1ccc(N": 830, "Cc1ccc(NC(=O)": 831, "Cc1ccc(OC)": 832, "Cc1ccc(S(=O)(=O)": 833, "Cc1ccc(S(=O)(=O)N": 834, "Cc1ccc(S(=O)(=O)N2": 835, "Cc1ccc2c(": 836, "Cc1ccc2c(c1)": 837, "Cc1cccc(": 838, "Cc1cccc(C)c1": 839, "Cc1cccc2": 840, "Cc1ccccc1": 841, "Cc1ccccc1)": 842, "Cc1ccccc1)NC(=O)": 843, "Cc1cccnc1": 844, "Cc1cccnc1)": 845, "Cc1ccco1": 846, "Cc1cccs1)": 847, "Cc1cn": 848, "Cc1cn(": 849, "Cc1cs": 850, "Cc1n": 851, "Cc1nc(": 852, "Cc1nc(-": 853, "Cc1nc(N": 854, "Cc1nc2c(": 855, "Cc1nn(C)": 856, "Cc1no": 857, "Cc1o": 858, "Cc1s": 859, "Cc2c(": 860, "Cc2cc(": 861, "Cc2ccc(": 862, "Cc2ccc(-": 863, "Cc2ccc(C)cc2)": 864, "Cc2ccc(Cl)cc2)": 865, "Cc2ccc(F)cc2)": 866, "Cc2ccc(OC)cc2)": 867, "Cc2ccccc2": 868, "Cc2ccccc2)": 869, "Cc2ccccc2)CC1": 870, "Cc2ccccc2)c1": 871, "Cc2cn": 872, "Cc2n": 873, "Cc3c(": 874, "Cc3ccc(": 875, "Cc3ccccc3": 876, "Cc3ccccc3)": 877, "Cl": 878, "Cl)": 879, "Cl)c(": 880, "Cl)c(Cl)": 881, "Cl)c(Cl)c1": 882, "Cl)c(Cl)c1)": 883, "Cl)c1": 884, "Cl)c1)": 885, "Cl)c3)": 886, "Cl)cc": 887, "Cl)cc(": 888, "Cl)cc(Cl)": 889, "Cl)cc1": 890, "Cl)cc1)": 891, "Cl)cc2": 892, "Cl)cc2)": 893, "Cl)cc2Cl)": 894, "Cl)cc3": 895, "Cl)ccc1": 896, "Clc1ccc(": 897, "Cn1": 898, "Cn1c(": 899, "Cn1c(=O)": 900, "Cn1c2c(": 901, "Cn1cc": 902, "Cn1cc(": 903, "Cn1cn": 904, "Cn2": 905, "Cn2c(": 906, "Cn2c(=O)": 907, "Cn2cc": 908, "Cn2cc(": 909, "Cn2cn": 910, "Cn3": 911, "F": 912, "F)": 913, "F)c(": 914, "F)c(-": 915, "F)c(Cl)": 916, "F)c(F)": 917, "F)c1": 918, "F)cc": 919, "F)cc(": 920, "F)cc(F)": 921, "F)cc1": 922, "F)cc1)": 923, "F)cc2": 924, "F)cc2)": 925, "F)cc2)c1": 926, "F)cc2)cc1": 927, "F)cc3": 928, "F)ccc1": 929, "Fc1ccc(": 930, "I": 931, "I)": 932, "N": 933, "N#": 934, "N#Cc1c(": 935, "N#Cc1ccc(": 936, "N#Cc1cccc(": 937, "N(": 938, "N(C": 939, "N(C(=O)": 940, "N(C(=O)N": 941, "N(C(C)=O)": 942, "N(C(C)C)": 943, "N(C)": 944, "N(C)C": 945, "N(C)C(=O)": 946, "N(C)C)": 947, "N(CC": 948, "N(CC(=O)N": 949, "N(CC)CC": 950, "N(CC)CC)": 951, "N(Cc1ccccc1)": 952, "N(Cc2ccccc2)": 953, "N(S(=O)(=O)": 954, "N(c2ccccc2)": 955, "N)": 956, "N)=O)": 957, "N)N": 958, "N)c1": 959, "N)cc1": 960, "N)ncn": 961, "N1": 962, "N1)": 963, "N12": 964, "N1C": 965, "N1C(=O)": 966, "N1CC": 967, "N1CCC(": 968, "N1CCCC": 969, "N1CCCC1": 970, "N1CCCCC1": 971, "N1CCN(": 972, "N1CCN(C": 973, "N1CCN(C(=O)": 974, "N1CCOCC1": 975, "N1CCOCC1)": 976, "N2": 977, "N2)": 978, "N2C": 979, "N2C(=O)": 980, "N2CC": 981, "N2CCC(": 982, "N2CCCC": 983, "N2CCCC2)": 984, "N2CCCCC2)": 985, "N2CCN(": 986, "N2CCN(C": 987, "N2CCN(C(=O)": 988, "N2CCOCC2)": 989, "N3": 990, "N3CCN(": 991, "N3CCOCC3)": 992, "N4": 993, "N=": 994, "N=C(": 995, "N=C(N": 996, "N=C(N)": 997, "N=C(N)N": 998, "N=C1": 999, "N=C2": 1000, "NC": 1001, "NC(": 1002, "NC(=N)N": 1003, "NC(=O)": 1004, "NC(=O)C(": 1005, "NC(=O)C2": 1006, "NC(=O)CO": 1007, "NC(=O)N": 1008, "NC(=O)N1": 1009, "NC(=O)[C@H](": 1010, "NC(=O)[C@H](CC(C)C)": 1011, "NC(=O)c1cc(": 1012, "NC(=O)c1ccc(": 1013, "NC(=O)c1ccccc1": 1014, "NC(C)=O)": 1015, "NC(N)": 1016, "NC1": 1017, "NC1=N": 1018, "NC1=O": 1019, "NCC": 1020, "NS(=O)(=O)": 1021, "NS(=O)(=O)c1ccc(": 1022, "N[C@@H](": 1023, "N[C@H]1": 1024, "Nc1c(": 1025, "Nc1cc": 1026, "Nc1cc(": 1027, "Nc1ccc(": 1028, "Nc1cccc(": 1029, "Nc1ccccc1": 1030, "Nc1n": 1031, "Nc1nc(": 1032, "Nc1nc(-": 1033, "Nc1ncc(": 1034, "Nc1ncn": 1035, "O": 1036, "O)": 1037, "O)c(": 1038, "O)c(O)": 1039, "O)c1": 1040, "O)cc1": 1041, "O)cc2)": 1042, "O1": 1043, "O1)": 1044, "O2": 1045, "O2)": 1046, "O2)cc1": 1047, "O3)": 1048, "O4)": 1049, "O=": 1050, "O=C(": 1051, "O=C(/C=C/": 1052, "O=C(CN1": 1053, "O=C(CSc1n": 1054, "O=C(N": 1055, "O=C(N1": 1056, "O=C(Nc1ccc(": 1057, "O=C(O)": 1058, "O=C1": 1059, "O=C1N": 1060, "O=C1NC(=O)": 1061, "O=C1c2ccccc2": 1062, "O=S(": 1063, "O=S(=O)(": 1064, "O=S(=O)(N": 1065, "O=S1(=O)": 1066, "O=[N+]([O-])": 1067, "O=c1": 1068, "O=c1[nH]": 1069, "O=c1cc(": 1070, "OC": 1071, "OC(": 1072, "OC(=O)": 1073, "OC(C)": 1074, "OC(C)(C)": 1075, "OC(C)(C)C": 1076, "OC(C)(C)C)": 1077, "OC(C)=O)": 1078, "OC(C)C)": 1079, "OC)": 1080, "OC)c(": 1081, "OC)c(OC)": 1082, "OC)c(OC)c1": 1083, "OC)c(OC)c1)": 1084, "OC)c(OC)c3)": 1085, "OC)c(OC)cc1": 1086, "OC)c1": 1087, "OC)c1OC": 1088, "OC)cc(": 1089, "OC)cc(OC)": 1090, "OC)cc1": 1091, "OC)cc2)": 1092, "OC1": 1093, "OC1=O": 1094, "OC2": 1095, "OC3": 1096, "OC4": 1097, "OCC": 1098, "OCC(": 1099, "OCC(=O)": 1100, "OCC(=O)N": 1101, "OCC(O)": 1102, "OCC)": 1103, "OCC1": 1104, "OCC2": 1105, "OCC3": 1106, "OCCCC": 1107, "OCCCO": 1108, "OCCN": 1109, "OCCN(": 1110, "OCCO": 1111, "OCCO2": 1112, "OCCO2)": 1113, "OCCO3)": 1114, "OCCO4)": 1115, "OCCOCC": 1116, "OCO": 1117, "OCO2": 1118, "OCO2)": 1119, "OCO3": 1120, "OCO3)": 1121, "OCO4)": 1122, "OCO5)": 1123, "OCc1ccccc1": 1124, "OCc1ccccc1)": 1125, "OCc2ccccc2)": 1126, "OCc3ccccc3)": 1127, "O[C@@H](": 1128, "O[C@@H]1": 1129, "O[C@@H]2": 1130, "O[C@H](": 1131, "O[C@H](CO": 1132, "O[C@H]1": 1133, "O[C@H]2": 1134, "Oc1c(": 1135, "Oc1cc(": 1136, "Oc1ccc(": 1137, "Oc1ccccc1": 1138, "Oc2c(": 1139, "Oc2ccc(": 1140, "S": 1141, "S(=O)": 1142, "S(=O)(=O)": 1143, "S(=O)(=O)N": 1144, "S(=O)(=O)N(": 1145, "S(=O)(=O)N1": 1146, "S(=O)(=O)N2": 1147, "S(=O)(=O)N3": 1148, "S(=O)(=O)c1ccc(": 1149, "S(=O)(=O)c1ccccc1": 1150, "S(=O)(=O)c2ccc(": 1151, "S(C)": 1152, "S(C)(=O)=O": 1153, "S(C)(=O)=O)": 1154, "S(N)": 1155, "S(N)(=O)=O)": 1156, "S1": 1157, "S1(=O)=O": 1158, "S2": 1159, "S2(=O)=O": 1160, "SC)": 1161, "[C@@H](": 1162, "[C@@H](C)": 1163, "[C@@H](C)C": 1164, "[C@@H](CC(C)C)": 1165, "[C@@H](CO)": 1166, "[C@@H](NC(=O)": 1167, "[C@@H](O)": 1168, "[C@@H]1": 1169, "[C@@H]12": 1170, "[C@@H]1C": 1171, "[C@@H]1O": 1172, "[C@@H]2": 1173, "[C@@H]2C1": 1174, "[C@@H]2CC": 1175, "[C@@H]3": 1176, "[C@@]": 1177, "[C@@](": 1178, "[C@@]1": 1179, "[C@@]1(": 1180, "[C@@]1(C)": 1181, "[C@@]1(C)CC": 1182, "[C@@]1(O)": 1183, "[C@@]12": 1184, "[C@@]2(": 1185, "[C@@]2(C)": 1186, "[C@@]2(O)": 1187, "[C@@]21": 1188, "[C@@]3": 1189, "[C@H](": 1190, "[C@H](C(=O)O)": 1191, "[C@H](C(C)C)": 1192, "[C@H](C)": 1193, "[C@H](C)C": 1194, "[C@H](C)CO)": 1195, "[C@H](CO": 1196, "[C@H](CO)": 1197, "[C@H](N": 1198, "[C@H](NC(=O)": 1199, "[C@H](O)": 1200, "[C@H](O)[C@@H]1O": 1201, "[C@H](OC(=O)": 1202, "[C@H]1": 1203, "[C@H]12": 1204, "[C@H]1C": 1205, "[C@H]1CC[C@H](": 1206, "[C@H]1CO": 1207, "[C@H]1O": 1208, "[C@H]2": 1209, "[C@H]2CC[C@H](": 1210, "[C@H]2O": 1211, "[C@H]3": 1212, "[C@H]3CC": 1213, "[C@H]4": 1214, "[C@]": 1215, "[C@](": 1216, "[C@](C)(": 1217, "[C@](C)(O)": 1218, "[C@](O)(": 1219, "[C@]1": 1220, "[C@]1(": 1221, "[C@]1(C)": 1222, "[C@]12": 1223, "[C@]12C": 1224, "[C@]2(": 1225, "[C@]2(C)": 1226, "[C@]2(C)CC": 1227, "[C@]23": 1228, "[C@]3": 1229, "[C@]3(": 1230, "[C@]3(C)": 1231, "[C@]4(C)": 1232, "[H]": 1233, "[N+](=O)[O-]": 1234, "[N+](=O)[O-])": 1235, "[N+](=O)[O-])cc": 1236, "[N+](=O)[O-])cc1": 1237, "[N+](=O)[O-])cc2": 1238, "[N@@+]": 1239, "[O-]": 1240, "[O-])": 1241, "[n+](C)": 1242, "[n+]2": 1243, "[nH]": 1244, "[nH]1": 1245, "[nH]1)": 1246, "[nH]2)": 1247, "[nH]2)c1": 1248, "[nH]2)cc1": 1249, "[nH]3)": 1250, "[nH]c(": 1251, "[nH]c(-": 1252, "[nH]c(=O)": 1253, "[nH]c1": 1254, "[nH]c1)": 1255, "[nH]c12": 1256, "[nH]c2": 1257, "[nH]c2c1": 1258, "[nH]c3": 1259, "[nH]cc2": 1260, "[nH]n1": 1261, "[se]": 1262, "\\": 1263, "c": 1264, "c(": 1265, "c(-": 1266, "c(-c2ccc(": 1267, "c(-c2ccccc2)": 1268, "c(-c2n": 1269, "c(-c3ccc(": 1270, "c(-c3ccccc3)": 1271, "c(-c4ccccc4)": 1272, "c(-n2": 1273, "c(=O)": 1274, "c(=O)[nH]": 1275, "c(=O)[nH]1": 1276, "c(=O)[nH]c(=O)": 1277, "c(=O)[nH]c1=O": 1278, "c(=O)[nH]c2=O)": 1279, "c(=O)c(": 1280, "c(=O)c(C(=O)O)": 1281, "c(=O)c1": 1282, "c(=O)c2c1": 1283, "c(=O)cc(": 1284, "c(=O)n(": 1285, "c(=O)n(-": 1286, "c(=O)n(C": 1287, "c(=O)n(C)": 1288, "c(=O)n(C)c(=O)": 1289, "c(=O)n1": 1290, "c(=O)n2": 1291, "c(=O)n3": 1292, "c(=O)o": 1293, "c(=S)": 1294, "c(Br)": 1295, "c(Br)c1": 1296, "c(C": 1297, "c(C#N)": 1298, "c(C(=O)": 1299, "c(C(=O)N": 1300, "c(C(=O)O)": 1301, "c(C(C)C)": 1302, "c(C(F)(F)F)": 1303, "c(C(N)=O)": 1304, "c(C)": 1305, "c(C)c(": 1306, "c(C)c(C)": 1307, "c(C)c1": 1308, "c(C)c1)": 1309, "c(C)c2": 1310, "c(C)c2)": 1311, "c(C)c3)": 1312, "c(C)cc(": 1313, "c(C)cc(C)": 1314, "c(C)cc1": 1315, "c(C)n1": 1316, "c(CC)": 1317, "c(CN": 1318, "c(CO": 1319, "c(Cl)": 1320, "c(Cl)c1": 1321, "c(Cl)c2)": 1322, "c(Cl)cc1": 1323, "c(F)": 1324, "c(F)c1": 1325, "c(F)c2)": 1326, "c(F)c3)": 1327, "c(F)cc1": 1328, "c(F)cc2": 1329, "c(N": 1330, "c(N(C)C)": 1331, "c(N)": 1332, "c(N2": 1333, "c(N3": 1334, "c(N4": 1335, "c(NC": 1336, "c(NC(": 1337, "c(NC(=O)": 1338, "c(NC(=O)N": 1339, "c(O": 1340, "c(O)": 1341, "c(O)c(": 1342, "c(O)c1": 1343, "c(O)cc1": 1344, "c(OC)": 1345, "c(OC)c(OC)": 1346, "c(OC)c1": 1347, "c(OC)c1)": 1348, "c(OC)cc1": 1349, "c(OCC": 1350, "c(OCC)": 1351, "c(S": 1352, "c-2": 1353, "c1": 1354, "c1)": 1355, "c1)N": 1356, "c1-": 1357, "c1-2": 1358, "c1-c1ccccc1": 1359, "c12": 1360, "c12)": 1361, "c13)": 1362, "c1=O": 1363, "c1=O)": 1364, "c1C": 1365, "c1C)": 1366, "c1N": 1367, "c1O": 1368, "c1O)": 1369, "c1[nH]": 1370, "c1c(": 1371, "c1c(-": 1372, "c1c(-c2ccc(": 1373, "c1c(-c2ccccc2)": 1374, "c1c(=O)": 1375, "c1c(Br)": 1376, "c1c(C(": 1377, "c1c(C(=O)N": 1378, "c1c(C(F)(F)F)": 1379, "c1c(C)": 1380, "c1c(C)cc(": 1381, "c1c(C)cccc1": 1382, "c1c(Cl)": 1383, "c1c(Cl)cc(": 1384, "c1c(Cl)ccc(": 1385, "c1c(Cl)cccc1": 1386, "c1c(F)ccc(": 1387, "c1c(F)cccc1": 1388, "c1c(N": 1389, "c1c(N)": 1390, "c1c(NC(=O)": 1391, "c1c(O)": 1392, "c1c(O)c(": 1393, "c1c(OC)": 1394, "c1c(OCC": 1395, "c1c2c(": 1396, "c1c[nH]": 1397, "c1cc": 1398, "c1cc(": 1399, "c1cc(-": 1400, "c1cc(-c2ccc(": 1401, "c1cc(-c2n": 1402, "c1cc(-n2": 1403, "c1cc(=O)": 1404, "c1cc(Br)": 1405, "c1cc(C(=O)N": 1406, "c1cc(C)": 1407, "c1cc(C)ccc1": 1408, "c1cc(Cl)": 1409, "c1cc(Cl)c(": 1410, "c1cc(Cl)cc": 1411, "c1cc(Cl)cc(": 1412, "c1cc(Cl)ccc1": 1413, "c1cc(F)c(": 1414, "c1cc(F)cc": 1415, "c1cc(F)ccc1": 1416, "c1cc(N": 1417, "c1cc(NC(=O)": 1418, "c1cc(O": 1419, "c1cc(O)": 1420, "c1cc(O)c(O)": 1421, "c1cc(OC)": 1422, "c1cc(OC)c(": 1423, "c1cc(OC)ccc1": 1424, "c1cc2": 1425, "c1cc2c(": 1426, "c1cc2c(cc1": 1427, "c1cc2cc(": 1428, "c1cc2cccc": 1429, "c1ccc(": 1430, "c1ccc(-": 1431, "c1ccc(-c2ccc(": 1432, "c1ccc(-c2ccccc2)cc1": 1433, "c1ccc(-c2n": 1434, "c1ccc(-n2": 1435, "c1ccc(Br)cc1": 1436, "c1ccc(Br)cc1)": 1437, "c1ccc(C(": 1438, "c1ccc(C(=O)N": 1439, "c1ccc(C(N": 1440, "c1ccc(C)": 1441, "c1ccc(C)cc1": 1442, "c1ccc(C2": 1443, "c1ccc(CN": 1444, "c1ccc(Cl)": 1445, "c1ccc(Cl)c(": 1446, "c1ccc(Cl)cc1": 1447, "c1ccc(Cl)cc1)": 1448, "c1ccc(Cl)cc1Cl": 1449, "c1ccc(F)cc1": 1450, "c1ccc(F)cc1)": 1451, "c1ccc(N": 1452, "c1ccc(N2": 1453, "c1ccc(NC(": 1454, "c1ccc(NC(=O)": 1455, "c1ccc(O": 1456, "c1ccc(O)": 1457, "c1ccc(O)c(O)": 1458, "c1ccc(O)cc1": 1459, "c1ccc(O)cc1)": 1460, "c1ccc(OC)": 1461, "c1ccc(OC)cc1": 1462, "c1ccc(OC)cc1)": 1463, "c1ccc(OCC": 1464, "c1ccc2[nH]": 1465, "c1ccc2c(": 1466, "c1ccc2c(c1)": 1467, "c1ccc2c(c1)OCO2": 1468, "c1ccc2c(c1)OCO2)": 1469, "c1ccc2ccccc2c1": 1470, "c1ccc2nc(": 1471, "c1cccc": 1472, "c1cccc(": 1473, "c1cccc(-c2n": 1474, "c1cccc(C)": 1475, "c1cccc(C)c1": 1476, "c1cccc(Cl)c1": 1477, "c1cccc(Cl)c1)": 1478, "c1cccc(F)c1": 1479, "c1cccc(F)c1)": 1480, "c1cccc(N": 1481, "c1cccc(NC(=O)": 1482, "c1cccc2": 1483, "c1cccc2c1": 1484, "c1cccc2ccccc12": 1485, "c1ccccc1": 1486, "c1ccccc1)": 1487, "c1ccccc1)N": 1488, "c1ccccc1)c1ccccc1": 1489, "c1ccccc1-": 1490, "c1ccccc12": 1491, "c1ccccc1Cl)": 1492, "c1ccccc1F": 1493, "c1ccccc1F)": 1494, "c1ccccc1O": 1495, "c1ccccn1": 1496, "c1ccccn1)": 1497, "c1cccnc1": 1498, "c1cccnc1)": 1499, "c1ccco1": 1500, "c1ccco1)": 1501, "c1cccs1": 1502, "c1cccs1)": 1503, "c1ccncc1": 1504, "c1ccncc1)": 1505, "c1cn": 1506, "c1cn(": 1507, "c1cn(C)": 1508, "c1cn2": 1509, "c1cnc(": 1510, "c1cnc(N": 1511, "c1cncc(": 1512, "c1cnccc1": 1513, "c1cnn2": 1514, "c1co": 1515, "c1cs": 1516, "c1n": 1517, "c1n(": 1518, "c1n[nH]": 1519, "c1nc(": 1520, "c1nc(-": 1521, "c1nc(-c2ccccc2)": 1522, "c1nc(C)": 1523, "c1nc(N": 1524, "c1nc(N)": 1525, "c1nc2c(": 1526, "c1nc2ccccc2": 1527, "c1ncc": 1528, "c1ncc(": 1529, "c1nccc(": 1530, "c1ncccc1": 1531, "c1ncn": 1532, "c1ncn2": 1533, "c1nnc(": 1534, "c1nnc(-": 1535, "c1o": 1536, "c1oc(": 1537, "c1s": 1538, "c1sc(": 1539, "c1sccc1": 1540, "c2": 1541, "c2)": 1542, "c2)C1": 1543, "c2)CC1": 1544, "c2)c1": 1545, "c2)cc(": 1546, "c2)cc1": 1547, "c2)cc1)": 1548, "c2)cc1OC": 1549, "c2)ccc1": 1550, "c2)n1": 1551, "c2)nc1": 1552, "c2-": 1553, "c21": 1554, "c21)": 1555, "c23)": 1556, "c23)CC1": 1557, "c23)c1": 1558, "c23)cc1": 1559, "c2=O)": 1560, "c2=O)c1": 1561, "c2=O)cc1": 1562, "c2C)": 1563, "c2C)cc1": 1564, "c2C1": 1565, "c2Cl)": 1566, "c2F)": 1567, "c2N": 1568, "c2O)": 1569, "c2[nH]": 1570, "c2[nH]1": 1571, "c2c(": 1572, "c2c(-": 1573, "c2c(-c3ccccc3)": 1574, "c2c(=O)": 1575, "c2c(=O)n1": 1576, "c2c(C#N)": 1577, "c2c(C)": 1578, "c2c(C)cc(C)": 1579, "c2c(Cl)": 1580, "c2c(Cl)cc(": 1581, "c2c(Cl)cccc2": 1582, "c2c(Cl)cccc2Cl)": 1583, "c2c(F)": 1584, "c2c(F)cc(": 1585, "c2c(F)cccc2": 1586, "c2c(N": 1587, "c2c(N)": 1588, "c2c(O)": 1589, "c2c(OC)": 1590, "c2c(c1": 1591, "c2c(c1)": 1592, "c2c(n1)": 1593, "c2c1": 1594, "c2c1)": 1595, "c2c1=O": 1596, "c2c3": 1597, "c2c3c(": 1598, "c2c3ccccc3": 1599, "c2c[nH]": 1600, "c2c[nH]c3ccccc23)": 1601, "c2cc": 1602, "c2cc(": 1603, "c2cc(-": 1604, "c2cc(-c3ccccc3)": 1605, "c2cc(=O)": 1606, "c2cc(Br)": 1607, "c2cc(Br)cc": 1608, "c2cc(C(=O)N": 1609, "c2cc(C(F)(F)F)cc": 1610, "c2cc(C)": 1611, "c2cc(C)cc(C)": 1612, "c2cc(C)ccc2": 1613, "c2cc(Cl)": 1614, "c2cc(Cl)c(": 1615, "c2cc(Cl)cc": 1616, "c2cc(Cl)cc(Cl)": 1617, "c2cc(Cl)ccc2": 1618, "c2cc(F)": 1619, "c2cc(F)c(": 1620, "c2cc(F)cc": 1621, "c2cc(N": 1622, "c2cc(N3": 1623, "c2cc(NC(=O)": 1624, "c2cc(O": 1625, "c2cc(O)": 1626, "c2cc(OC)": 1627, "c2cc(OC)c(OC)": 1628, "c2cc(OC)c(OC)c(OC)": 1629, "c2cc(OC)c(OC)c(OC)c2)": 1630, "c2cc(OC)ccc2": 1631, "c2cc(S(=O)(=O)N": 1632, "c2cc1": 1633, "c2cc1OC": 1634, "c2cc3": 1635, "c2cc3c(": 1636, "c2cc3c(cc2": 1637, "c2cc3cccc": 1638, "c2cc3ccccc3": 1639, "c2ccc(": 1640, "c2ccc(-": 1641, "c2ccc(-c3ccccc3)cc2)": 1642, "c2ccc(-c3n": 1643, "c2ccc(-n3": 1644, "c2ccc(Br)cc2": 1645, "c2ccc(Br)cc2)": 1646, "c2ccc(C#N)cc2)": 1647, "c2ccc(C(=O)N": 1648, "c2ccc(C)": 1649, "c2ccc(C)cc2": 1650, "c2ccc(C)cc2)": 1651, "c2ccc(Cl)": 1652, "c2ccc(Cl)c(Cl)": 1653, "c2ccc(Cl)c(Cl)c2)": 1654, "c2ccc(Cl)cc2": 1655, "c2ccc(Cl)cc2)": 1656, "c2ccc(Cl)cc2)c1": 1657, "c2ccc(Cl)cc2)cc1": 1658, "c2ccc(Cl)cc2Cl)": 1659, "c2ccc(F)cc2": 1660, "c2ccc(F)cc2)": 1661, "c2ccc(F)cc2)CC1": 1662, "c2ccc(N": 1663, "c2ccc(N(C)C)": 1664, "c2ccc(N3": 1665, "c2ccc(NC(=O)": 1666, "c2ccc(O": 1667, "c2ccc(O)": 1668, "c2ccc(O)cc2": 1669, "c2ccc(O)cc2)": 1670, "c2ccc(OC": 1671, "c2ccc(OC)": 1672, "c2ccc(OC)c(OC)": 1673, "c2ccc(OC)cc2)": 1674, "c2ccc(OCC": 1675, "c2ccc(S(=O)(=O)N": 1676, "c2ccc(S(=O)(=O)N3": 1677, "c2ccc3[nH]": 1678, "c2ccc3c(": 1679, "c2ccc3c(c2)": 1680, "c2ccc3c(c2)OCO3)": 1681, "c2ccc3ccccc3": 1682, "c2ccc3ccccc3c2)": 1683, "c2ccc3n": 1684, "c2cccc": 1685, "c2cccc(": 1686, "c2cccc(-": 1687, "c2cccc(C(F)(F)F)c2)": 1688, "c2cccc(C)": 1689, "c2cccc(C)c2)": 1690, "c2cccc(Cl)": 1691, "c2cccc(Cl)c2)": 1692, "c2cccc(F)": 1693, "c2cccc(F)c2)": 1694, "c2cccc(N": 1695, "c2cccc(O": 1696, "c2cccc(O)": 1697, "c2cccc(OC)": 1698, "c2cccc(OC)c2)": 1699, "c2cccc([N+](=O)[O-])": 1700, "c2cccc3": 1701, "c2cccc3c2": 1702, "c2cccc3ccccc23)": 1703, "c2ccccc12": 1704, "c2ccccc12)": 1705, "c2ccccc2": 1706, "c2ccccc2)": 1707, "c2ccccc2)C1": 1708, "c2ccccc2)CC1": 1709, "c2ccccc2)c1": 1710, "c2ccccc2)cc1": 1711, "c2ccccc2)cc1)": 1712, "c2ccccc2)ccc1": 1713, "c2ccccc2)n1": 1714, "c2ccccc21": 1715, "c2ccccc21)": 1716, "c2ccccc2C)": 1717, "c2ccccc2C1": 1718, "c2ccccc2Cl)": 1719, "c2ccccc2F)": 1720, "c2ccccc2O)": 1721, "c2ccccc2c1": 1722, "c2ccccc2c1)": 1723, "c2ccccc2c1=O": 1724, "c2ccccc2n1": 1725, "c2ccccn2)": 1726, "c2cccn": 1727, "c2cccnc2": 1728, "c2cccnc2)": 1729, "c2ccco": 1730, "c2ccco2)": 1731, "c2cccs2)": 1732, "c2ccn": 1733, "c2ccncc2": 1734, "c2ccncc2)": 1735, "c2cco": 1736, "c2ccs": 1737, "c2cn": 1738, "c2cn(": 1739, "c2cn(C)": 1740, "c2cnn3": 1741, "c2co": 1742, "c2cs": 1743, "c2n": 1744, "c2n(": 1745, "c2n(C": 1746, "c2n(C)": 1747, "c2n1": 1748, "c2nc(": 1749, "c2nc(-": 1750, "c2nc(-c3ccccc3)": 1751, "c2nc(C)": 1752, "c2nc(N": 1753, "c2nc(N)": 1754, "c2nc(N3": 1755, "c2nc(O)": 1756, "c2nc1": 1757, "c2nc3c(": 1758, "c2nc3ccccc3": 1759, "c2ncc": 1760, "c2ncc(": 1761, "c2ncc(-": 1762, "c2nccc(": 1763, "c2ncccc2": 1764, "c2ncn": 1765, "c2ncn(": 1766, "c2ncnc(N": 1767, "c2ncnc3": 1768, "c2nnc(": 1769, "c2nnc(-": 1770, "c2no": 1771, "c2o": 1772, "c2oc(-": 1773, "c2s": 1774, "c2sc(": 1775, "c2sc3c(": 1776, "c2sccc2": 1777, "c3": 1778, "c3)": 1779, "c3)CC2)": 1780, "c3)cc": 1781, "c3)cc2": 1782, "c3)cc2)": 1783, "c3-": 1784, "c32)": 1785, "c32)cc1": 1786, "c34)": 1787, "c3=O)": 1788, "c3C)": 1789, "c3Cl)": 1790, "c3F)": 1791, "c3O)": 1792, "c3[nH]": 1793, "c3c(": 1794, "c3c(-": 1795, "c3c(=O)": 1796, "c3c(C)": 1797, "c3c(Cl)": 1798, "c3c(Cl)cccc3": 1799, "c3c(F)": 1800, "c3c(F)cccc3": 1801, "c3c(N)": 1802, "c3c(O)": 1803, "c3c(OC)": 1804, "c3c(c1)": 1805, "c3c1": 1806, "c3c2": 1807, "c3c2)": 1808, "c3c4c(": 1809, "c3c4ccccc4": 1810, "c3c[nH]": 1811, "c3cc": 1812, "c3cc(": 1813, "c3cc(-": 1814, "c3cc(Br)cc": 1815, "c3cc(C(=O)N": 1816, "c3cc(C(F)(F)F)cc": 1817, "c3cc(C)": 1818, "c3cc(Cl)c(": 1819, "c3cc(Cl)cc": 1820, "c3cc(Cl)ccc3": 1821, "c3cc(F)cc": 1822, "c3cc(O)": 1823, "c3cc(O)ccc3": 1824, "c3cc(OC)": 1825, "c3cc(OC)c(OC)c(OC)": 1826, "c3cc(OC)c(OC)cc3": 1827, "c3cc4": 1828, "c3cc4c(": 1829, "c3cc4c(cc3": 1830, "c3cc4ccccc4": 1831, "c3ccc(": 1832, "c3ccc(-": 1833, "c3ccc(Br": 1834, "c3ccc(Br)cc3)": 1835, "c3ccc(C#N)cc3)": 1836, "c3ccc(C(=O)N": 1837, "c3ccc(C(=O)O)": 1838, "c3ccc(C)": 1839, "c3ccc(C)cc3": 1840, "c3ccc(C)cc3)": 1841, "c3ccc(Cl)": 1842, "c3ccc(Cl)c(Cl)c3)": 1843, "c3ccc(Cl)cc": 1844, "c3ccc(Cl)cc3": 1845, "c3ccc(Cl)cc3)": 1846, "c3ccc(Cl)cc3Cl)": 1847, "c3ccc(F)cc": 1848, "c3ccc(F)cc3": 1849, "c3ccc(F)cc3)": 1850, "c3ccc(N": 1851, "c3ccc(N4": 1852, "c3ccc(NC(=O)": 1853, "c3ccc(O": 1854, "c3ccc(O)": 1855, "c3ccc(O)cc3)": 1856, "c3ccc(OC)": 1857, "c3ccc(OC)cc3": 1858, "c3ccc(OC)cc3)": 1859, "c3ccc(OCC": 1860, "c3ccc(S(=O)(=O)N": 1861, "c3ccc4c(": 1862, "c3ccc4c(c3)": 1863, "c3ccc4c(c3)OCO4)": 1864, "c3ccc4ccccc4": 1865, "c3cccc": 1866, "c3cccc(": 1867, "c3cccc(-": 1868, "c3cccc(C(F)(F)F)c3)": 1869, "c3cccc(C)": 1870, "c3cccc(C)c3)": 1871, "c3cccc(Cl)": 1872, "c3cccc(Cl)c3)": 1873, "c3cccc(F)": 1874, "c3cccc(F)c3)": 1875, "c3cccc(N": 1876, "c3cccc(O)": 1877, "c3cccc4": 1878, "c3cccc4cccc": 1879, "c3ccccc13)": 1880, "c3ccccc23)": 1881, "c3ccccc23)cc1": 1882, "c3ccccc3": 1883, "c3ccccc3)": 1884, "c3ccccc3)CC2)": 1885, "c3ccccc3)CC2)cc1": 1886, "c3ccccc3)cc": 1887, "c3ccccc3)cc2": 1888, "c3ccccc3)cc2)": 1889, "c3ccccc3-": 1890, "c3ccccc32)": 1891, "c3ccccc32)cc1": 1892, "c3ccccc3C)": 1893, "c3ccccc3C2=O)": 1894, "c3ccccc3Cl)": 1895, "c3ccccc3F)": 1896, "c3ccccc3OC)": 1897, "c3ccccc3c(=O)": 1898, "c3ccccn3)": 1899, "c3cccn": 1900, "c3cccnc3": 1901, "c3cccnc3)": 1902, "c3ccco": 1903, "c3ccco3)": 1904, "c3cccs3)": 1905, "c3ccn": 1906, "c3ccncc3)": 1907, "c3cco": 1908, "c3ccs": 1909, "c3cn": 1910, "c3cn(C)": 1911, "c3cs": 1912, "c3n": 1913, "c3n(": 1914, "c3n2": 1915, "c3n2)": 1916, "c3n[nH]": 1917, "c3nc(": 1918, "c3nc(-": 1919, "c3nc(C)": 1920, "c3nc(N": 1921, "c3nc(N)": 1922, "c3nc4c(": 1923, "c3nc4ccccc4": 1924, "c3ncc": 1925, "c3ncc(": 1926, "c3ncccc3": 1927, "c3ncccn3)": 1928, "c3ncn": 1929, "c3nnn": 1930, "c3o": 1931, "c3s": 1932, "c4": 1933, "c4)": 1934, "c4)CC3)": 1935, "c4)cc": 1936, "c43)": 1937, "c45)": 1938, "c4[nH]": 1939, "c4c(": 1940, "c4c(C)": 1941, "c4c3": 1942, "c4c3)": 1943, "c4cc": 1944, "c4cc(": 1945, "c4cc(C)": 1946, "c4cc(Cl)cc": 1947, "c4cc(F)cc": 1948, "c4cc5": 1949, "c4cc5c(": 1950, "c4ccc(": 1951, "c4ccc(-": 1952, "c4ccc(C)cc4)": 1953, "c4ccc(Cl)cc": 1954, "c4ccc(Cl)cc4": 1955, "c4ccc(Cl)cc4)": 1956, "c4ccc(F)cc": 1957, "c4ccc(F)cc4": 1958, "c4ccc(F)cc4)": 1959, "c4ccc(N": 1960, "c4ccc(O)": 1961, "c4ccc(OC)": 1962, "c4ccc(OC)cc4)": 1963, "c4ccc5c(c4)": 1964, "c4cccc": 1965, "c4cccc(Cl)": 1966, "c4cccc(F)": 1967, "c4cccc5": 1968, "c4ccccc34)": 1969, "c4ccccc4": 1970, "c4ccccc4)": 1971, "c4ccccc4)CC3)": 1972, "c4ccccc4)cc3)": 1973, "c4ccccc43)": 1974, "c4ccccn4)": 1975, "c4cccn": 1976, "c4cccnc4)": 1977, "c4ccco4)": 1978, "c4cccs": 1979, "c4ccncc": 1980, "c4ccncc4)": 1981, "c4cn": 1982, "c4n": 1983, "c4n(": 1984, "c4n3)": 1985, "c4ncc": 1986, "c4ncn": 1987, "c4nn": 1988, "c4o": 1989, "c4s": 1990, "c5": 1991, "c5)": 1992, "c5c(": 1993, "c5cc": 1994, "c5cc(": 1995, "c5ccc(": 1996, "c5cccc": 1997, "c5ccccc5": 1998, "c5ccccc5)": 1999, "c5cn": 2000, "c6": 2001, "c6ccccc6": 2002, "c[nH]": 2003, "c[nH]1": 2004, "cc": 2005, "cc(": 2006, "cc(-": 2007, "cc(-c3ccccc3)": 2008, "cc(=O)": 2009, "cc(C(=O)N": 2010, "cc(C)": 2011, "cc(C)c1": 2012, "cc(C)cc1": 2013, "cc(Cl)": 2014, "cc(N": 2015, "cc(NC(=O)": 2016, "cc(O)": 2017, "cc(OC)": 2018, "cc1": 2019, "cc1)": 2020, "cc1-": 2021, "cc12": 2022, "cc2": 2023, "cc2)": 2024, "cc2)c1": 2025, "cc2)cc1": 2026, "cc2)ccc1": 2027, "cc21": 2028, "cc2C)": 2029, "cc2c(": 2030, "cc2c1": 2031, "cc3": 2032, "cc3)": 2033, "cc3)cc": 2034, "cc3)cc2)": 2035, "cc3C)": 2036, "cc3c(": 2037, "cc4": 2038, "cc4)": 2039, "cc5": 2040, "ccc(": 2041, "ccc(-": 2042, "ccc(C)": 2043, "ccc(Cl)": 2044, "ccc(F)": 2045, "ccc(N": 2046, "ccc(O)": 2047, "ccc(OC)": 2048, "ccc1": 2049, "ccc12": 2050, "ccc1O": 2051, "ccc2": 2052, "ccc21": 2053, "ccc2c1": 2054, "ccc3": 2055, "ccc4": 2056, "ccc5": 2057, "cccc": 2058, "cccc(": 2059, "cccc1": 2060, "cccc12": 2061, "cccc2": 2062, "cccc3": 2063, "cccc3)": 2064, "cccc4": 2065, "cccc4)": 2066, "ccccc1": 2067, "ccccc12": 2068, "ccccc4": 2069, "cccn": 2070, "ccn1": 2071, "ccn1)": 2072, "ccn2)": 2073, "ccn3)": 2074, "ccnc1": 2075, "cn": 2076, "cn(": 2077, "cn(C)": 2078, "cn1": 2079, "cn1)": 2080, "cn2": 2081, "cn2)": 2082, "cn2)CC1": 2083, "cn2)c1": 2084, "cn2)cc1": 2085, "cn3": 2086, "cn3)": 2087, "cn4)": 2088, "cnc(N": 2089, "cnc1": 2090, "cnc1)": 2091, "cnc12": 2092, "cnc2": 2093, "cnc2)": 2094, "cnc2c1ncn2": 2095, "cnc3": 2096, "cnn1": 2097, "cnn2": 2098, "co": 2099, "cs": 2100, "cs1": 2101, "cs1)": 2102, "cs2)": 2103, "cs2)c1": 2104, "cs2)cc1": 2105, "cs3)": 2106, "n": 2107, "n(": 2108, "n(-": 2109, "n(-c2ccc(": 2110, "n(-c2ccccc2)": 2111, "n(-c3ccccc3)": 2112, "n(C": 2113, "n(C(C)C)": 2114, "n(C)": 2115, "n(C)c(=O)": 2116, "n(C)c(=O)n(C)": 2117, "n(C)c1": 2118, "n(CC": 2119, "n(CC(=O)N": 2120, "n(CC)": 2121, "n(Cc2ccccc2)": 2122, "n(Cc3ccccc3)": 2123, "n1": 2124, "n1)": 2125, "n1-": 2126, "n12": 2127, "n1C": 2128, "n1c(": 2129, "n1c(=O)": 2130, "n1cc": 2131, "n1cc(": 2132, "n1ccc(": 2133, "n1cn": 2134, "n2": 2135, "n2)": 2136, "n2)C1": 2137, "n2)CC1": 2138, "n2)c1": 2139, "n2)cc(": 2140, "n2)cc1": 2141, "n2)ccc1": 2142, "n2)n1": 2143, "n2C": 2144, "n2C)": 2145, "n2c(": 2146, "n2c(=O)": 2147, "n2c1": 2148, "n2c3c(": 2149, "n2cc": 2150, "n2cc(": 2151, "n2cn": 2152, "n2cnc3c(": 2153, "n3": 2154, "n3)": 2155, "n3)cc": 2156, "n3)cc2": 2157, "n3)cc2)": 2158, "n3C)": 2159, "n3c(": 2160, "n3cc": 2161, "n3cn": 2162, "n4": 2163, "n4)": 2164, "n4cn": 2165, "n5": 2166, "n[nH]": 2167, "n[nH]1": 2168, "nc(": 2169, "nc(-": 2170, "nc(-c2ccccc2)": 2171, "nc(-c3ccccc3)": 2172, "nc(C(=O)N": 2173, "nc(C(F)(F)F)": 2174, "nc(C)": 2175, "nc(C)c1": 2176, "nc(Cl)": 2177, "nc(N": 2178, "nc(N)": 2179, "nc(N2": 2180, "nc(N3": 2181, "nc(N3CCOCC3)": 2182, "nc(O)": 2183, "nc(OC)": 2184, "nc(S": 2185, "nc(SC": 2186, "nc(SCC(=O)N": 2187, "nc1": 2188, "nc1)": 2189, "nc1-": 2190, "nc12": 2191, "nc1C": 2192, "nc1N": 2193, "nc2": 2194, "nc2)": 2195, "nc2)c1": 2196, "nc2)cc1": 2197, "nc2-": 2198, "nc21": 2199, "nc23)": 2200, "nc2C)": 2201, "nc2N": 2202, "nc2c(": 2203, "nc2c1": 2204, "nc2cc1": 2205, "nc2ccccc12": 2206, "nc2ccccc21": 2207, "nc2n(": 2208, "nc2n1": 2209, "nc3": 2210, "nc3)": 2211, "nc32)": 2212, "nc3C)": 2213, "nc3c(": 2214, "nc3c2": 2215, "nc3ccccc3": 2216, "nc3n2": 2217, "nc4": 2218, "nc4)": 2219, "ncc": 2220, "ncc(": 2221, "ncc(-": 2222, "ncc1": 2223, "ncc1)": 2224, "ncc2": 2225, "ncc3": 2226, "ncc4": 2227, "nccc1": 2228, "nccc2": 2229, "ncn": 2230, "ncn1": 2231, "ncn2": 2232, "ncn3)": 2233, "ncnc(N": 2234, "ncnc2": 2235, "ncnc3": 2236, "nn": 2237, "nn(": 2238, "nn(-": 2239, "nn(C": 2240, "nn(C)": 2241, "nn1": 2242, "nn1)": 2243, "nn12": 2244, "nn2": 2245, "nn2)": 2246, "nn2)c1": 2247, "nn2)cc1": 2248, "nn3": 2249, "nn3)": 2250, "nnc(": 2251, "nnc(-": 2252, "nnc1": 2253, "nnc2": 2254, "nnn1": 2255, "nnn2": 2256, "no": 2257, "no1": 2258, "no1)": 2259, "no2)": 2260, "no2)cc1": 2261, "o": 2262, "o1": 2263, "o1)": 2264, "o2)": 2265, "o2)c1": 2266, "o2)cc1": 2267, "o3)": 2268, "oc(": 2269, "oc(-": 2270, "oc(=O)": 2271, "oc(C)": 2272, "oc1": 2273, "oc12": 2274, "oc2": 2275, "oc2c1": 2276, "on1": 2277, "on2)": 2278, "s": 2279, "s1": 2280, "s1)": 2281, "s2": 2282, "s2)": 2283, "s2)c1": 2284, "s2)cc1": 2285, "s3)": 2286, "sc(": 2287, "sc(-": 2288, "sc1": 2289, "sc1)": 2290, "sc2": 2291, "sc2c1": 2292, "sc3": 2293}